{
 "cells": [
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# Manufacturability Analysis for Industrialized Construction use case\n",
    "\n",
    "Follow the instructions and press the \"Run\" button."
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "***"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# 0. Preparation"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## 0.1 Install libraries\n",
    "Install Stardog (https://docs.stardog.com/get-started/install-stardog/) and the libraries imported below."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 111,
   "metadata": {},
   "outputs": [],
   "source": [
    "import os\n",
    "import stardog\n",
    "from owlready2 import *\n",
    "from pyshacl import validate\n",
    "from rdflib import Graph, Literal, URIRef\n",
    "from rdflib.namespace import RDF, SKOS, XSD\n",
    "from rdflib.plugins.stores import sparqlstore"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## 0.2 Define MAIC ontology file path\n",
    "MAIC ontology is saved as \"MAIC_Ontology.owl\"\n",
    "The file path has to be adjusted if \"MAIC_Ontology.owl\" is not saved in the same folder as this Python Notebook file."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 112,
   "metadata": {},
   "outputs": [],
   "source": [
    "owl_file_path = './MAIC_Ontology.owl'"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## 0.3 Load Ontology"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 113,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "get_ontology(\"http://www.semanticweb.org/maic#\")"
      ]
     },
     "execution_count": 113,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "onto = get_ontology(owl_file_path)\n",
    "onto.load()"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## 0.4 Define the use case data\n",
    "The variable \"use_case_data\" is specified for the use case described in the master thesis \"Manufacturability Analysis for Industrialized Construction\".\n",
    "\n",
    "Different scenarios can be simulated by choosing another use_case_designer_data_path. Just uncomment another line (but make sure not to comment the line with use_case_manufacturer_path)."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 114,
   "metadata": {},
   "outputs": [],
   "source": [
    "# Manufacturer's data\n",
    "use_case_manufacturer_path = './Use_Case_Data_Manufacturer.txt'\n",
    "\n",
    "# Designer's data\n",
    "# use_case_designer_data_path = './Use_Case_Data_Designer_Scenario_00.txt'# Use case data as collected.\n",
    "use_case_designer_data_path = './Use_Case_Data_Designer_Scenario_01.txt' # Waring because the production process cannot produce the type of the component (ProductionProcessRuleShape trigered).\n",
    "# use_case_designer_data_path = './Use_Case_Data_Designer_Scenario_02.txt' # Warning because there is no direct material with the same material type and fire classification (ComponentMaterialRuleShapeI triggered).\n",
    "# use_case_designer_data_path = './Use_Case_Data_Designer_Scenario_03.txt' # Warning because there is no direct material with the same material type and fire classification and equal or larger dimensions (ComponentMaterialRuleShapeII triggered).\n",
    "# use_case_designer_data_path = './Use_Case_Data_Designer_Scenario_04.txt' # Warning because there is no direct material with equal or larger dimensions with the capability to create the component's shape (ComponentMaterialRulesShapeIII triggered).\n",
    "# use_case_designer_data_path = './Use_Case_Data_Designer_Scenario_05.txt' # Warning becuase there is too little direct material for the production of all components (ComponentMaterialRuleShapeIV triggered).\n",
    "# use_case_designer_data_path = './Use_Case_Data_Designer_Scenario_06.txt' # Warning because there is no direct material with the same connection type (ConnectionMaterialShapeI triggered).\n",
    "# use_case_designer_data_path = './Use_Case_Data_Designer_Scenario_07.txt' # Warning because there is too little direct material for the production of all connections (ConnectionMaterialRuleShapeII triggered).\n",
    "# use_case_designer_data_path = './Use_Case_Data_Designer_Scenario_08.txt' # Waring because the workstation cannot handle the shape and size of the component (ShapeAndSizeRuleShapeI triggered).\n",
    "# use_case_designer_data_path = './Use_Case_Data_Designer_Scenario_09.txt' # Waring because the workstation cannot handle the mass of the component (ShapeAndSizeRuleShapeII triggered).\n",
    "# use_case_designer_data_path = './Use_Case_Data_Designer_Scenario_10.txt' # Waring because the equipment cannot create the negative shape and size of a component (NegativeShapeAndSizeRuleShape).\n",
    "# use_case_designer_data_path = './Use_Case_Data_Designer_Scenario_11.txt' # Waring because the equipment cannot achieve the tolerance demanded by all components of the product (ToleranceRuleShape).\n",
    "# use_case_designer_data_path = './Use_Case_Data_Designer_Scenario_12.txt' # Waring because the production process exceeds the lead time demanded (DurationRuleShapeI)."
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## 0.5 Load use case data"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 115,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "PREFIX maic:  <http://www.semanticweb.org/maic#>\n",
      "PREFIX rdf:   <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\n",
      "PREFIX sh:    <http://www.w3.org/ns/shacl#>\n",
      "PREFIX xsd:   <http://www.w3.org/2001/XMLSchema#>\n",
      "PREFIX rdfs:  <http://www.w3.org/2000/01/rdf-schema#>\n",
      "PREFIX owl:   <http://www.w3.org/2002/07/owl#>\n",
      "\n",
      "\n",
      "\n",
      "##################################################################################################################\n",
      "### Manufacturer's Data\n",
      "##################################################################################################################\n",
      "### Section of Production Process\n",
      "maic:ERNEs_Weinmann_Production_Process a maic:Production_Process ;\n",
      "maic:consistOf maic:Factory_Crane ;\n",
      "maic:consistOf maic:Framing_Station ;\n",
      "maic:consistOf maic:Weinmann_Multi_Functional_Bridge ;\n",
      "maic:consistOf maic:Truck ;\n",
      "maic:consistOf maic:Construction_Crane ;\n",
      ".\n",
      "\n",
      "\n",
      "\n",
      "##################################################################################################################\n",
      "\n",
      "### Section of WorkStation Factory Crane\n",
      "maic:Factory_Crane a maic:WorkStation ;\n",
      "maic:consistOf maic:Transport_to_Framing_Station ;\n",
      "maic:consistOf maic:Transport_to_Weinmann_Multi_Functional_Bridge ;\n",
      "maic:consistOf maic:Rotate_on_Weinmann_Multi_Functional_Bridge ;\n",
      "maic:consistOf maic:Transport_to_H-Bock ;\n",
      "maic:hasCapabilityToProduceType maic:Timber_Frame_Wall_Panel ;\n",
      "maic:hasCapabilityToProduceType maic:Timber_Frame ;\n",
      "maic:hasCapabilityToProduceType maic:Structural_Element ;\n",
      "maic:hasCapabilityToProduceType maic:Sheeting_Element ;\n",
      "maic:hasCapability maic:Factory_Crane_Transportation ;\n",
      ".\n",
      "\n",
      "### Activities\n",
      "maic:Transport_to_Framing_Station a maic:Activity ;\n",
      "maic:cycleTime_average \"300.0\"^^xsd:float ;\n",
      "maic:hasActivityCost \"15.0\"^^xsd:float ;\n",
      "maic:consumes maic:Factory_Crane_Operator ;\n",
      ".\n",
      "\n",
      "maic:Transport_to_Weinmann_Multi_Functional_Bridge a maic:Activity ;\n",
      "maic:cycleTime_average \"300.0\"^^xsd:float ;\n",
      "maic:hasActivityCost \"15.0\"^^xsd:float ;\n",
      "maic:consumes maic:Factory_Crane_Operator ;\n",
      ".\n",
      "\n",
      "maic:Rotate_on_Weinmann_Multi_Functional_Bridge a maic:Activity ;\n",
      "maic:cycleTime_average \"300.0\"^^xsd:float ;\n",
      "maic:hasActivityCost \"15.0\"^^xsd:float ;\n",
      "maic:consumes maic:Factory_Crane_Operator ;\n",
      ".\n",
      "\n",
      "maic:Transport_to_H-Bock a maic:Activity ;\n",
      "maic:cycleTime_average \"300.0\"^^xsd:float ;\n",
      "maic:hasActivityCost \"15.0\"^^xsd:float ;\n",
      "maic:consumes maic:Factory_Crane_Operator ;\n",
      ".\n",
      "\n",
      "### Resources\n",
      "maic:Factory_Crane_Operator a maic:Direct_Labour ;\n",
      "maic:hasResourceCost \"7.5\"^^xsd:float ;\n",
      "maic:hasCapability maic:Road_Transportation ;\n",
      ".\n",
      "\n",
      "### Capabilities\n",
      "maic:Factory_Crane_Transportation a maic:Simple_Capability ;\n",
      "maic:hasAllowedItemShapeAndSize_min maic:Industry_Crane_Min_ShapeAndSize ;\n",
      "maic:hasAllowedItemShapeAndSize_max maic:Industry_Crane_Max_ShapeAndSize ;\n",
      ".\n",
      "\n",
      "### ShapeAndSizes\n",
      "maic:Industry_Crane_Min_ShapeAndSize a maic:BoxShape ;\n",
      "maic:mass \"0.0\"^^xsd:float ;\n",
      ".\n",
      "\n",
      "maic:Industry_Crane_Max_ShapeAndSize a maic:BoxShape ;\n",
      "maic:mass \"10000.0\"^^xsd:float ;\n",
      ".\n",
      "\n",
      "\n",
      "\n",
      "##################################################################################################################\n",
      "\n",
      "### Section of WorkStation Framing Station\n",
      "maic:Framing_Station a maic:WorkStation ;\n",
      "maic:consistOf maic:Screw_Timber_Frame ;\n",
      "maic:hasCapabilityToProduceType maic:Timber_Frame ;\n",
      "maic:hasCapability maic:Factory_Crane_Transportation ;\n",
      ".\n",
      "\n",
      "### Activities\n",
      "maic:Screw_Timber_Frame a maic:Activity ;\n",
      "maic:cycleTime_average \"1200.0\"^^xsd:float ;\n",
      "maic:hasActivityCost \"60.0\"^^xsd:float ;\n",
      "maic:consumes maic:Structural_OSB ;\n",
      "maic:consumes maic:Glulam_Timber ;\n",
      "maic:consumes maic:Screw ;\n",
      "maic:consumes maic:Screw_Driver ;\n",
      "maic:consumes maic:Framing_Construction_Worker ;\n",
      ".\n",
      "\n",
      "### Resources\n",
      "maic:Glulam_Timber a maic:Direct_Material ;\n",
      "maic:hasResourceCost \"400.0\"^^xsd:float ;\n",
      "maic:materialType \"Glulam timber\"^^xsd:string ;\n",
      "maic:fireMaterialClassification \"RF3\"^^xsd:string ;\n",
      "maic:hasCount \"1000\"^^xsd:int ;\n",
      "maic:hasAnyShapeAndSize \"true\"^^xsd:boolean ;\n",
      "maic:hasType maic:Structural_Element ;\n",
      "maic:hasCapability maic:Framing ;\n",
      ".\n",
      "\n",
      "maic:Structural_OSB a maic:Direct_Material ;\n",
      "maic:hasResourceCost \"50.0\"^^xsd:float ;\n",
      "maic:materialType \"Uncoated chip material\"^^xsd:string ;\n",
      "maic:fireMaterialClassification \"RF3\"^^xsd:string ;\n",
      "maic:hasCount \"1000\"^^xsd:int ;\n",
      "maic:hasAnyShapeAndSize \"true\"^^xsd:boolean ;\n",
      "maic:hasType maic:Structural_Element ;\n",
      "maic:hasCapability maic:Framing ;\n",
      ".\n",
      "\n",
      "\n",
      "maic:Screw a maic:Direct_Material ;\n",
      "maic:hasResourceCost \"0.03\"^^xsd:float ;\n",
      "maic:connectionType \"Direct connection with mechanical fixing devices\"^^xsd:string ;\n",
      "maic:hasCount \"1000\"^^xsd:int ;\n",
      "maic:hasType maic:Connection_Element ;\n",
      "maic:hasCapability maic:Framing ;\n",
      ".\n",
      "\n",
      "maic:Screw_Driver a maic:Direct_Equipment ;\n",
      "maic:hasResourceCost \"0.0\"^^xsd:float ;\n",
      "maic:hasCapability maic:Framing ;\n",
      ".\n",
      "\n",
      "maic:Framing_Construction_Worker a maic:Direct_Labour ;\n",
      "maic:hasResourceCost \"55.0\"^^xsd:float ;\n",
      "maic:hasCapability maic:Framing ;\n",
      ".\n",
      "\n",
      "### Typologies\n",
      "maic:Timber_Frame a maic:Frame ;\n",
      ".\n",
      "\n",
      "### Capabilites\n",
      "maic:Framing a maic:Simple_Capability ;\n",
      "maic:tolerance \"1.0\"^^xsd:float ;\n",
      "maic:connectionMaterialIndex \"3.0\"^^xsd:float ;\n",
      ".\n",
      "\n",
      "\n",
      "\n",
      "##################################################################################################################\n",
      "\n",
      "### Section of WorkStation Weinmann Multi Functional Bridge\n",
      "maic:Weinmann_Multi_Functional_Bridge a maic:WorkStation ;\n",
      "maic:consistOf maic:Lay_Out_Panel ;\n",
      "maic:consistOf maic:Clamp_Panel ;\n",
      "maic:consistOf maic:Nail_Sheeting ;\n",
      "maic:consistOf maic:Trimm_Sheeting ;\n",
      "maic:hasCapabilityToProduceType maic:Timber_Frame_Wall_Panel ;\n",
      "maic:hasCapability maic:Weinmann_Panel_Assembly ;\n",
      ".\n",
      "\n",
      "### Activities\n",
      "maic:Lay_Out_Panel a maic:Activity ;\n",
      "maic:cycleTime_average \"300.0\"^^xsd:float ;\n",
      "maic:hasActivityCost: \"15.0\"^^xsd:float ;\n",
      "maic:consumes maic:Weinmann_Construction_Worker ;\n",
      "maic:consumes maic:Gypsum_Panel_2750-2500-15 ;\n",
      "maic:consumes maic:Gypsum_Panel_3000-2500-15 ;\n",
      "maic:consumes maic:Gypsum_Panel_3500-2500-15 ;\n",
      "maic:consumes maic:Gypsum_Panel_2750-1250-15 ;\n",
      "maic:consumes maic:Gypsum_Panel_3000-1250-15 ;\n",
      "maic:consumes maic:Gypsum_Panel_3500-1250-15 ;\n",
      "maic:consumes maic:Gypsum_Panel_2750-2500-18 ;\n",
      "maic:consumes maic:Gypsum_Panel_3000-2500-18 ;\n",
      "maic:consumes maic:Gypsum_Panel_3500-2500-18 ;\n",
      "maic:consumes maic:Gypsum_Panel_2750-1250-18 ;\n",
      "maic:consumes maic:Gypsum_Panel_3000-1250-18 ;\n",
      "maic:consumes maic:Gypsum_Panel_3500-1250-18 ;\n",
      "maic:consumes maic:OSB_Panel_2000-2500-15 ;\n",
      "maic:consumes maic:OSB_Panel_3500-2500-15 ;\n",
      "maic:consumes maic:OSB_Panel_9000-2800-25 ;\n",
      "maic:consumes maic:OSB_Panel_12000-2800-25 ;\n",
      "maic:consumes maic:OSB_Panel_15000-2800-25 ;\n",
      "maic:consumes maic:Fiber_Insulation_Wool ;\n",
      ".\n",
      "\n",
      "maic:Clamp_Panel a maic:Activity ;\n",
      "maic:cycleTime_average \"300.0\"^^xsd:float ;\n",
      "maic:hasActivityCost: \"15.0\"^^xsd:float ;\n",
      "maic:consumes maic:Weinmann_Construction_Worker ;\n",
      ".\n",
      "\n",
      "maic:Nail_Sheeting a maic:Activity ;\n",
      "maic:cycleTime_average \"300.0\"^^xsd:float ;\n",
      "maic:hasActivityCost: \"45.0\"^^xsd:float ;\n",
      "maic:consumes maic:Weinmann_Operator ;\n",
      "maic:consumes maic:Weinmann_Fastening_Unit ;\n",
      "maic:consumes maic:Weinmann_Nail ;\n",
      "maic:hasCapability maic:Weinmann_Sheeting_Nailing ;\n",
      ".\n",
      "\n",
      "maic:Trimm_Sheeting a maic:Activity ;\n",
      "maic:cycleTime_average \"300.0\"^^xsd:float ;\n",
      "maic:hasActivityCost: \"45.0\"^^xsd:float ;\n",
      "maic:consumes maic:Weinmann_Operator ;\n",
      "maic:consumes maic:Weinmann_Saw ;\n",
      "maic:consumes maic:Weinmann_Trimmer ;\n",
      "maic:hasCapability maic:Weinmann_Sheeting_Sawing ;\n",
      "maic:hasCapability maic:Weinmann_Sheeting_Trimming ;\n",
      ".\n",
      "\n",
      "### Resources\n",
      "maic:Weinmann_Operator a maic:Direct_Labour ;\n",
      "maic:hasResourceCost \"17.5\"^^xsd:float ;\n",
      "maic:hasCapability maic:Weinmann_Sheeting_Nailing ;\n",
      "maic:hasCapability maic:Weinmann_Sheeting_Sawing ;\n",
      "maic:hasCapability maic:Weinmann_Sheeting_Trimming ;\n",
      ".\n",
      "\n",
      "maic:Weinmann_Construction_Worker a maic:Direct_Labour ;\n",
      "maic:hasResourceCost \"7.5\"^^xsd:float ;\n",
      ".\n",
      "\n",
      "maic:Weinmann_Fastening_Unit a maic:Direct_Equipment ;\n",
      "maic:hasResourceCost \"0.0\"^^xsd:float ;\n",
      "maic:hasCapability maic:Weinmann_Sheeting_Nailing ;\n",
      ".\n",
      "\n",
      "maic:Weinmann_Saw a maic:Direct_Equipment ;\n",
      "maic:hasResourceCost \"0.0\"^^xsd:float ;\n",
      "maic:hasCapability maic:Weinmann_Sheeting_Sawing ;\n",
      ".\n",
      "\n",
      "maic:Weinmann_Trimmer a maic:Direct_Equipment ;\n",
      "maic:hasResourceCost \"0.0\"^^xsd:float ;\n",
      "maic:hasCapability maic:Weinmann_Sheeting_Trimming ;\n",
      ".\n",
      "\n",
      "maic:Weinmann_Nail a maic:Direct_Material ;\n",
      "maic:hasResourceCost \"0.01\"^^xsd:float ;\n",
      "maic:connectionType \"Direct connection with mechanical fixing devices\"^^xsd:string ;\n",
      "maic:hasCount \"198\"^^xsd:int ;\n",
      "maic:hasType maic:Connection_Element ;\n",
      "maic:hasCapability maic:Weinmann_Sheeting_Nailing ;\n",
      ".\n",
      "\n",
      "maic:Gypsum_Panel_2750-2500-15 a maic:Direct_Material ;\n",
      "maic:hasResourceCost \"67.5\"^^xsd:float ;\n",
      "maic:materialType \"Fiber material\"^^xsd:string ;\n",
      "maic:fireMaterialClassification \"RF1\"^^xsd:string ;\n",
      "maic:hasCount \"4\"^^xsd:int ;\n",
      "maic:hasAnyShapeAndSize \"false\"^^xsd:boolean ;\n",
      "maic:hasShapeAndSize maic:Gypsum_Panel_2750-2500-15_ShapeAndSize ;\n",
      "maic:hasType maic:Sheeting_Element ;\n",
      "maic:hasCapability maic:Weinmann_Sheeting_Nailing ;\n",
      "maic:hasCapability maic:Weinmann_Sheeting_Sawing ;\n",
      "maic:hasCapability maic:Weinmann_Sheeting_Trimming ;\n",
      ".\n",
      "\n",
      "maic:Gypsum_Panel_3000-2500-15 a maic:Direct_Material ;\n",
      "maic:hasResourceCost \"75.0\"^^xsd:float ;\n",
      "maic:materialType \"Fiber material\"^^xsd:string ;\n",
      "maic:fireMaterialClassification \"RF1\"^^xsd:string ;\n",
      "maic:hasCount \"4\"^^xsd:int ;\n",
      "maic:hasAnyShapeAndSize \"false\"^^xsd:boolean ;\n",
      "maic:hasShapeAndSize maic:Gypsum_Panel_3000-2500-15_ShapeAndSize ;\n",
      "maic:hasType maic:Sheeting_Element ;\n",
      "maic:hasCapability maic:Weinmann_Sheeting_Nailing ;\n",
      "maic:hasCapability maic:Weinmann_Sheeting_Sawing ;\n",
      "maic:hasCapability maic:Weinmann_Sheeting_Trimming ;\n",
      ".\n",
      "\n",
      "maic:Gypsum_Panel_3500-2500-15 a maic:Direct_Material ;\n",
      "maic:hasResourceCost \"87.5\"^^xsd:float ;\n",
      "maic:materialType \"Fiber material\"^^xsd:string ;\n",
      "maic:fireMaterialClassification \"RF1\"^^xsd:string ;\n",
      "maic:hasCount \"4\"^^xsd:int ;\n",
      "maic:hasAnyShapeAndSize \"false\"^^xsd:boolean ;\n",
      "maic:hasShapeAndSize maic:Gypsum_Panel_3500-2500-15_ShapeAndSize ;\n",
      "maic:hasType maic:Sheeting_Element ;\n",
      "maic:hasCapability maic:Weinmann_Sheeting_Nailing ;\n",
      "maic:hasCapability maic:Weinmann_Sheeting_Sawing ;\n",
      "maic:hasCapability maic:Weinmann_Sheeting_Trimming ;\n",
      ".\n",
      "\n",
      "maic:Gypsum_Panel_2750-1250-15 a maic:Direct_Material ;\n",
      "maic:hasResourceCost \"34.5\"^^xsd:float ;\n",
      "maic:materialType \"Fiber material\"^^xsd:string ;\n",
      "maic:fireMaterialClassification \"RF1\"^^xsd:string ;\n",
      "maic:hasCount \"4\"^^xsd:int ;\n",
      "maic:hasAnyShapeAndSize \"false\"^^xsd:boolean ;\n",
      "maic:hasShapeAndSize maic:Gypsum_Panel_2750-1250-15_ShapeAndSize ;\n",
      "maic:hasType maic:Sheeting_Element ;\n",
      "maic:hasCapability maic:Weinmann_Sheeting_Nailing ;\n",
      "maic:hasCapability maic:Weinmann_Sheeting_Sawing ;\n",
      "maic:hasCapability maic:Weinmann_Sheeting_Trimming ;\n",
      ".\n",
      "\n",
      "maic:Gypsum_Panel_3000-1250-15 a maic:Direct_Material ;\n",
      "maic:hasResourceCost \"37.5\"^^xsd:float ;\n",
      "maic:materialType \"Fiber material\"^^xsd:string ;\n",
      "maic:fireMaterialClassification \"RF1\"^^xsd:string ;\n",
      "maic:hasCount \"4\"^^xsd:int ;\n",
      "maic:hasAnyShapeAndSize \"false\"^^xsd:boolean ;\n",
      "maic:hasShapeAndSize maic:Gypsum_Panel_3000-1250-15_ShapeAndSize ;\n",
      "maic:hasType maic:Sheeting_Element ;\n",
      "maic:hasCapability maic:Weinmann_Sheeting_Nailing ;\n",
      "maic:hasCapability maic:Weinmann_Sheeting_Sawing ;\n",
      "maic:hasCapability maic:Weinmann_Sheeting_Trimming ;\n",
      ".\n",
      "\n",
      "maic:Gypsum_Panel_3500-1250-15 a maic:Direct_Material ;\n",
      "maic:hasResourceCost \"43.75\"^^xsd:float ;\n",
      "maic:materialType \"Fiber material\"^^xsd:string ;\n",
      "maic:fireMaterialClassification \"RF1\"^^xsd:string ;\n",
      "maic:hasCount \"4\"^^xsd:int ;\n",
      "maic:hasAnyShapeAndSize \"false\"^^xsd:boolean ;\n",
      "maic:hasShapeAndSize maic:Gypsum_Panel_3500-1250-15_ShapeAndSize ;\n",
      "maic:hasType maic:Sheeting_Element ;\n",
      "maic:hasCapability maic:Weinmann_Sheeting_Nailing ;\n",
      "maic:hasCapability maic:Weinmann_Sheeting_Sawing ;\n",
      "maic:hasCapability maic:Weinmann_Sheeting_Trimming ;\n",
      ".\n",
      "\n",
      "maic:Gypsum_Panel_2750-2500-18 a maic:Direct_Material ;\n",
      "maic:hasResourceCost \"82.5\"^^xsd:float ;\n",
      "maic:materialType \"Fiber material\"^^xsd:string ;\n",
      "maic:fireMaterialClassification \"RF1\"^^xsd:string ;\n",
      "maic:hasCount \"1000\"^^xsd:int ;\n",
      "maic:hasAnyShapeAndSize \"false\"^^xsd:boolean ;\n",
      "maic:hasShapeAndSize maic:Gypsum_Panel_2750-2500-18_ShapeAndSize ;\n",
      "maic:hasType maic:Sheeting_Element ;\n",
      "maic:hasCapability maic:Weinmann_Sheeting_Nailing ;\n",
      "maic:hasCapability maic:Weinmann_Sheeting_Sawing ;\n",
      "maic:hasCapability maic:Weinmann_Sheeting_Trimming ;\n",
      ".\n",
      "\n",
      "maic:Gypsum_Panel_3000-2500-18 a maic:Direct_Material ;\n",
      "maic:hasResourceCost \"90.0\"^^xsd:float ;\n",
      "maic:materialType \"Fiber material\"^^xsd:string ;\n",
      "maic:fireMaterialClassification \"RF1\"^^xsd:string ;\n",
      "maic:hasCount \"1000\"^^xsd:int ;\n",
      "maic:hasAnyShapeAndSize \"false\"^^xsd:boolean ;\n",
      "maic:hasShapeAndSize maic:Gypsum_Panel_3000-2500-18_ShapeAndSize ;\n",
      "maic:hasType maic:Sheeting_Element ;\n",
      "maic:hasCapability maic:Weinmann_Sheeting_Nailing ;\n",
      "maic:hasCapability maic:Weinmann_Sheeting_Sawing ;\n",
      "maic:hasCapability maic:Weinmann_Sheeting_Trimming ;\n",
      ".\n",
      "\n",
      "maic:Gypsum_Panel_3500-2500-18 a maic:Direct_Material ;\n",
      "maic:hasResourceCost \"105.0\"^^xsd:float ;\n",
      "maic:materialType \"Fiber material\"^^xsd:string ;\n",
      "maic:fireMaterialClassification \"RF1\"^^xsd:string ;\n",
      "maic:hasCount \"1000\"^^xsd:int ;\n",
      "maic:hasAnyShapeAndSize \"false\"^^xsd:boolean ;\n",
      "maic:hasShapeAndSize maic:Gypsum_Panel_3500-2500-18_ShapeAndSize ;\n",
      "maic:hasType maic:Sheeting_Element ;\n",
      "maic:hasCapability maic:Weinmann_Sheeting_Nailing ;\n",
      "maic:hasCapability maic:Weinmann_Sheeting_Sawing ;\n",
      "maic:hasCapability maic:Weinmann_Sheeting_Trimming ;\n",
      ".\n",
      "\n",
      "maic:Gypsum_Panel_2750-1250-18 a maic:Direct_Material ;\n",
      "maic:hasResourceCost \"41.25\"^^xsd:float ;\n",
      "maic:materialType \"Fiber material\"^^xsd:string ;\n",
      "maic:fireMaterialClassification \"RF1\"^^xsd:string ;\n",
      "maic:hasCount \"1000\"^^xsd:int ;\n",
      "maic:hasAnyShapeAndSize \"false\"^^xsd:boolean ;\n",
      "maic:hasShapeAndSize maic:Gypsum_Panel_2750-1250-18_ShapeAndSize ;\n",
      "maic:hasType maic:Sheeting_Element ;\n",
      "maic:hasCapability maic:Weinmann_Sheeting_Nailing ;\n",
      "maic:hasCapability maic:Weinmann_Sheeting_Sawing ;\n",
      "maic:hasCapability maic:Weinmann_Sheeting_Trimming ;\n",
      ".\n",
      "\n",
      "\n",
      "maic:Gypsum_Panel_3000-1250-18 a maic:Direct_Material ;\n",
      "maic:hasResourceCost \"45.0\"^^xsd:float ;\n",
      "maic:materialType \"Fiber material\"^^xsd:string ;\n",
      "maic:fireMaterialClassification \"RF1\"^^xsd:string ;\n",
      "maic:hasCount \"1000\"^^xsd:int ;\n",
      "maic:hasAnyShapeAndSize \"false\"^^xsd:boolean ;\n",
      "maic:hasShapeAndSize maic:Gypsum_Panel_3000-1250-18_ShapeAndSize ;\n",
      "maic:hasType maic:Sheeting_Element ;\n",
      "maic:hasCapability maic:Weinmann_Sheeting_Nailing ;\n",
      "maic:hasCapability maic:Weinmann_Sheeting_Sawing ;\n",
      "maic:hasCapability maic:Weinmann_Sheeting_Trimming ;\n",
      ".\n",
      "\n",
      "maic:Gypsum_Panel_3500-1250-18 a maic:Direct_Material ;\n",
      "maic:hasResourceCost \"52.50\"^^xsd:float ;\n",
      "maic:materialType \"Fiber material\"^^xsd:string ;\n",
      "maic:fireMaterialClassification \"RF1\"^^xsd:string ;\n",
      "maic:hasCount \"1000\"^^xsd:int ;\n",
      "maic:hasAnyShapeAndSize \"false\"^^xsd:boolean ;\n",
      "maic:hasShapeAndSize maic:Gypsum_Panel_3500-1250-18_ShapeAndSize ;\n",
      "maic:hasType maic:Sheeting_Element ;\n",
      "maic:hasCapability maic:Weinmann_Sheeting_Nailing ;\n",
      "maic:hasCapability maic:Weinmann_Sheeting_Sawing ;\n",
      "maic:hasCapability maic:Weinmann_Sheeting_Trimming ;\n",
      ".\n",
      "\n",
      "maic:OSB_Panel_2000-2500-15 a maic:Direct_Material ;\n",
      "maic:hasResourceCost \"30.0\"^^xsd:float ;\n",
      "maic:materialType \"Uncoated chip material\"^^xsd:string ;\n",
      "maic:fireMaterialClassification \"RF3\"^^xsd:string ;\n",
      "maic:hasCount \"1000\"^^xsd:int ;\n",
      "maic:hasAnyShapeAndSize \"false\"^^xsd:boolean ;\n",
      "maic:hasShapeAndSize maic:OSB_Panel_2000-2500-15_ShapeAndSize ;\n",
      "maic:hasType maic:Sheeting_Element ;\n",
      "maic:hasCapability maic:Weinmann_Sheeting_Nailing ;\n",
      "maic:hasCapability maic:Weinmann_Sheeting_Sawing ;\n",
      "maic:hasCapability maic:Weinmann_Sheeting_Trimming ;\n",
      ".\n",
      "\n",
      "maic:OSB_Panel_3500-2500-15 a maic:Direct_Material ;\n",
      "maic:hasResourceCost \"52.50\"^^xsd:float ;\n",
      "maic:materialType \"Uncoated chip material\"^^xsd:string ;\n",
      "maic:fireMaterialClassification \"RF3\"^^xsd:string ;\n",
      "maic:hasCount \"1000\"^^xsd:int ;\n",
      "maic:hasAnyShapeAndSize \"false\"^^xsd:boolean ;\n",
      "maic:hasShapeAndSize maic:OSB_Panel_3500-2500-15_ShapeAndSize ;\n",
      "maic:hasType maic:Sheeting_Element ;\n",
      "maic:hasCapability maic:Weinmann_Sheeting_Nailing ;\n",
      "maic:hasCapability maic:Weinmann_Sheeting_Sawing ;\n",
      "maic:hasCapability maic:Weinmann_Sheeting_Trimming ;\n",
      ".\n",
      "\n",
      "maic:OSB_Panel_9000-2800-25 a maic:Direct_Material ;\n",
      "maic:hasResourceCost \"201.60\"^^xsd:float ;\n",
      "maic:materialType \"Uncoated chip material\"^^xsd:string ;\n",
      "maic:fireMaterialClassification \"RF3\"^^xsd:string ;\n",
      "maic:hasCount \"1000\"^^xsd:int ;\n",
      "maic:hasAnyShapeAndSize \"false\"^^xsd:boolean ;\n",
      "maic:hasShapeAndSize maic:OSB_Panel_9000-2800-25_ShapeAndSize ;\n",
      "maic:hasType maic:Sheeting_Element ;\n",
      "maic:hasCapability maic:Weinmann_Sheeting_Nailing ;\n",
      "maic:hasCapability maic:Weinmann_Sheeting_Sawing ;\n",
      "maic:hasCapability maic:Weinmann_Sheeting_Trimming ;\n",
      ".\n",
      "\n",
      "maic:OSB_Panel_12000-2800-25 a maic:Direct_Material ;\n",
      "maic:hasResourceCost \"268.80\"^^xsd:float ;\n",
      "maic:materialType \"Uncoated chip material\"^^xsd:string ;\n",
      "maic:fireMaterialClassification \"RF3\"^^xsd:string ;\n",
      "maic:hasCount \"1000\"^^xsd:int ;\n",
      "maic:hasAnyShapeAndSize \"false\"^^xsd:boolean ;\n",
      "maic:hasShapeAndSize maic:OSB_Panel_12000-2800-25_ShapeAndSize ;\n",
      "maic:hasType maic:Sheeting_Element ;\n",
      "maic:hasCapability maic:Weinmann_Sheeting_Nailing ;\n",
      "maic:hasCapability maic:Weinmann_Sheeting_Sawing ;\n",
      "maic:hasCapability maic:Weinmann_Sheeting_Trimming ;\n",
      ".\n",
      "\n",
      "maic:OSB_Panel_15000-2800-25 a maic:Direct_Material ;\n",
      "maic:hasResourceCost \"336.0\"^^xsd:float ;\n",
      "maic:materialType \"Uncoated chip material\"^^xsd:string ;\n",
      "maic:fireMaterialClassification \"RF3\"^^xsd:string ;\n",
      "maic:hasCount \"1000\"^^xsd:int ;\n",
      "maic:hasAnyShapeAndSize \"false\"^^xsd:boolean ;\n",
      "maic:hasShapeAndSize maic:OSB_Panel_15000-2800-25_ShapeAndSize ;\n",
      "maic:hasType maic:Sheeting_Element ;\n",
      "maic:hasCapability maic:Weinmann_Sheeting_Nailing ;\n",
      "maic:hasCapability maic:Weinmann_Sheeting_Sawing ;\n",
      "maic:hasCapability maic:Weinmann_Sheeting_Trimming ;\n",
      ".\n",
      "\n",
      "maic:Fiber_Insulation_Wool a maic:Direct_Material ;\n",
      "maic:hasResourceCost \"20.0\"^^xsd:float ;\n",
      "maic:materialType \"Mineral wool\"^^xsd:string ;\n",
      "maic:fireMaterialClassification \"none\"^^xsd:string ;\n",
      "maic:hasCount \"1000\"^^xsd:int ;\n",
      "maic:hasAnyShapeAndSize \"true\"^^xsd:boolean ;\n",
      "maic:hasType maic:Insulation_Element ;\n",
      ".\n",
      "\n",
      "### Typologies\n",
      "maic:Timber_Frame_Wall_Panel a maic:Panel ;\n",
      ".\n",
      "\n",
      "maic:Structural_Element a maic:Element ;\n",
      ".\n",
      "\n",
      "maic:Sheeting_Element a maic:Element ;\n",
      ".\n",
      "\n",
      "maic:Insulation_Element a maic:Element ;\n",
      ".\n",
      "\n",
      "maic:Connection_Element a maic:Element ;\n",
      ".\n",
      "\n",
      "### Capabilities\n",
      "maic:Weinmann_Panel_Assembly a maic:Combined_Capability ;\n",
      "maic:tolerance \"1.0\"^^xsd:float ;\n",
      "maic:isComposedOf maic:Weinmann_Sheeting_Nailing ;\n",
      "maic:isComposedOf maic:Weinmann_Sheeting_Sawing ;\n",
      "maic:isComposedOf maic:Weinmann_Sheeting_Trimming ;\n",
      "maic:hasAllowedItemShapeAndSize_min maic:Weinmann_Min_ShapeAndSize ;\n",
      "maic:hasAllowedItemShapeAndSize_max maic:Weinmann_Max_ShapeAndSize ;\n",
      ".\n",
      "\n",
      "maic:Weinmann_Sheeting_Nailing a maic:Simple_Capability ;\n",
      "maic:connectionMaterialIndex \"3.0\"^^xsd:float ;\n",
      ".\n",
      "\n",
      "maic:Weinmann_Sheeting_Sawing a maic:Simple_Capability ;\n",
      "maic:tolerance \"1.0\"^^xsd:float ;\n",
      "maic:hasAllowedNegativeItemShapeAndSize_min maic:Weinmann_Sawing_Min_ShapeAndSize ;\n",
      "maic:hasAllowedNegativeItemShapeAndSize_max maic:Weinmann_Sawing_Max_ShapeAndSize ;\n",
      ".\n",
      "\n",
      "maic:Weinmann_Sheeting_Trimming a maic:Simple_Capability ;\n",
      "maic:tolerance \"1.0\"^^xsd:float ;\n",
      "maic:hasAllowedNegativeItemShapeAndSize_min maic:Weinmann_Trimming_Min_ShapeAndSize ;\n",
      "maic:hasAllowedNegativeItemShapeAndSize_max maic:Weinmann_Trimming_Max_ShapeAndSize ;\n",
      ".\n",
      "\n",
      "### ShapeAndSizes\n",
      "maic:Weinmann_Min_ShapeAndSize a maic:BoxShape ;\n",
      "maic:dimension_x \"1.0\"^^xsd:float ;\n",
      "maic:dimension_y \"1.0\"^^xsd:float ;\n",
      "maic:dimension_z \"1.0\"^^xsd:float ;\n",
      "maic:mass \"0.0\"^^xsd:float ;\n",
      ".\n",
      "\n",
      "maic:Weinmann_Max_ShapeAndSize a maic:BoxShape ;\n",
      "maic:dimension_x \"45000.0\"^^xsd:float ;\n",
      "maic:dimension_y \"4000.0\"^^xsd:float ;\n",
      "maic:dimension_z \"400.0\"^^xsd:float ;\n",
      "maic:mass \"20000.0\"^^xsd:float ;\n",
      ".\n",
      "\n",
      "maic:Weinmann_Sawing_Min_ShapeAndSize a maic:BoxShape ;\n",
      "maic:dimension_x \"300.0\"^^xsd:float ;\n",
      "maic:dimension_y \"300.0\"^^xsd:float ;\n",
      "maic:dimension_z \"1.0\"^^xsd:float ;\n",
      ".\n",
      "\n",
      "maic:Weinmann_Sawing_Max_ShapeAndSize a maic:BoxShape ;\n",
      "maic:dimension_x \"45000.0\"^^xsd:float ;\n",
      "maic:dimension_y \"4000.0\"^^xsd:float ;\n",
      "maic:dimension_z \"60.0\"^^xsd:float ;\n",
      ".\n",
      "\n",
      "maic:Weinmann_Trimming_Min_ShapeAndSize a maic:BoxShape ;\n",
      "maic:dimension_x \"16.0\"^^xsd:float ;\n",
      "maic:dimension_y \"16.0\"^^xsd:float ;\n",
      "maic:dimension_z \"1.0\"^^xsd:float ;\n",
      ".\n",
      "\n",
      "maic:Weinmann_Trimming_Max_ShapeAndSize a maic:BoxShape ;\n",
      "maic:dimension_x \"45000.0\"^^xsd:float ;\n",
      "maic:dimension_y \"4000.0\"^^xsd:float ;\n",
      "maic:dimension_z \"60.0\"^^xsd:float ;\n",
      ".\n",
      "\n",
      "\n",
      "maic:Gypsum_Panel_2750-2500-15_ShapeAndSize a maic:BoxShape ;\n",
      "maic:dimension_x \"2750\"^^xsd:float ;\n",
      "maic:dimension_y \"2500\"^^xsd:float ;\n",
      "maic:dimension_z \"15\"^^xsd:float ;\n",
      "maic:mass \"123.75\"^^xsd:float ;\n",
      ".\n",
      "\n",
      "maic:Gypsum_Panel_3000-2500-15_ShapeAndSize a maic:BoxShape ;\n",
      "maic:dimension_x \"3000\"^^xsd:float ;\n",
      "maic:dimension_y \"2500\"^^xsd:float ;\n",
      "maic:dimension_z \"15\"^^xsd:float ;\n",
      "maic:mass \"135.0\"^^xsd:float ;\n",
      ".\n",
      "\n",
      "maic:Gypsum_Panel_3500-2500-15_ShapeAndSize a maic:BoxShape ;\n",
      "maic:dimension_x \"3500\"^^xsd:float ;\n",
      "maic:dimension_y \"2500\"^^xsd:float ;\n",
      "maic:dimension_z \"15\"^^xsd:float ;\n",
      "maic:mass \"157.5\"^^xsd:float ;\n",
      ".\n",
      "\n",
      "maic:Gypsum_Panel_2750-1250-15_ShapeAndSize a maic:BoxShape ;\n",
      "maic:dimension_x \"2750\"^^xsd:float ;\n",
      "maic:dimension_y \"1250\"^^xsd:float ;\n",
      "maic:dimension_z \"15\"^^xsd:float ;\n",
      "maic:mass \"123.75\"^^xsd:float ;\n",
      ".\n",
      "\n",
      "maic:Gypsum_Panel_3000-1250-15_ShapeAndSize a maic:BoxShape ;\n",
      "maic:dimension_x \"3000\"^^xsd:float ;\n",
      "maic:dimension_y \"1250\"^^xsd:float ;\n",
      "maic:dimension_z \"15\"^^xsd:float ;\n",
      "maic:mass \"67.5\"^^xsd:float ;\n",
      ".\n",
      "\n",
      "maic:Gypsum_Panel_3500-1250-15_ShapeAndSize a maic:BoxShape ;\n",
      "maic:dimension_x \"3500\"^^xsd:float ;\n",
      "maic:dimension_y \"1250\"^^xsd:float ;\n",
      "maic:dimension_z \"15\"^^xsd:float ;\n",
      "maic:mass \"78.75\"^^xsd:float ;\n",
      ".\n",
      "\n",
      "maic:Gypsum_Panel_2750-2500-18_ShapeAndSize a maic:BoxShape ;\n",
      "maic:dimension_x \"2750\"^^xsd:float ;\n",
      "maic:dimension_y \"2500\"^^xsd:float ;\n",
      "maic:dimension_z \"18\"^^xsd:float ;\n",
      "maic:mass \"148.5\"^^xsd:float ;\n",
      ".\n",
      "\n",
      "maic:Gypsum_Panel_3000-2500-18_ShapeAndSize a maic:BoxShape ;\n",
      "maic:dimension_x \"3000\"^^xsd:float ;\n",
      "maic:dimension_y \"2500\"^^xsd:float ;\n",
      "maic:dimension_z \"18\"^^xsd:float ;\n",
      "maic:mass \"162.0\"^^xsd:float ;\n",
      ".\n",
      "\n",
      "maic:Gypsum_Panel_3500-2500-18_ShapeAndSize a maic:BoxShape ;\n",
      "maic:dimension_x \"3500\"^^xsd:float ;\n",
      "maic:dimension_y \"2500\"^^xsd:float ;\n",
      "maic:dimension_z \"18\"^^xsd:float ;\n",
      "maic:mass \"189.0\"^^xsd:float ;\n",
      ".\n",
      "\n",
      "maic:Gypsum_Panel_2750-1250-18_ShapeAndSize a maic:BoxShape ;\n",
      "maic:dimension_x \"2750\"^^xsd:float ;\n",
      "maic:dimension_y \"1250\"^^xsd:float ;\n",
      "maic:dimension_z \"18\"^^xsd:float ;\n",
      "maic:mass \"74.25\"^^xsd:float ;\n",
      ".\n",
      "\n",
      "maic:Gypsum_Panel_3000-1250-18_ShapeAndSize a maic:BoxShape ;\n",
      "maic:dimension_x \"3000\"^^xsd:float ;\n",
      "maic:dimension_y \"1250\"^^xsd:float ;\n",
      "maic:dimension_z \"18\"^^xsd:float ;\n",
      "maic:mass \"81.0\"^^xsd:float ;\n",
      ".\n",
      "\n",
      "maic:Gypsum_Panel_3500-1250-18_ShapeAndSize a maic:BoxShape ;\n",
      "maic:dimension_x \"3500\"^^xsd:float ;\n",
      "maic:dimension_y \"1250\"^^xsd:float ;\n",
      "maic:dimension_z \"18\"^^xsd:float ;\n",
      "maic:mass \"94.5\"^^xsd:float ;\n",
      ".\n",
      "\n",
      "maic:OSB_Panel_2000-2500-15_ShapeAndSize a maic:BoxShape ;\n",
      "maic:dimension_x \"2000\"^^xsd:float ;\n",
      "maic:dimension_y \"2500\"^^xsd:float ;\n",
      "maic:dimension_z \"15\"^^xsd:float ;\n",
      "maic:mass \"37.5\"^^xsd:float ;\n",
      ".\n",
      "\n",
      "maic:OSB_Panel_3500-2500-15_ShapeAndSize a maic:BoxShape ;\n",
      "maic:dimension_x \"3500\"^^xsd:float ;\n",
      "maic:dimension_y \"2500\"^^xsd:float ;\n",
      "maic:dimension_z \"15\"^^xsd:float ;\n",
      "maic:mass \"65.625\"^^xsd:float ;\n",
      ".\n",
      "\n",
      "maic:OSB_Panel_9000-2800-25_ShapeAndSize a maic:BoxShape ;\n",
      "maic:dimension_x \"9000\"^^xsd:float ;\n",
      "maic:dimension_y \"2800\"^^xsd:float ;\n",
      "maic:dimension_z \"25\"^^xsd:float ;\n",
      "maic:mass \"315.0\"^^xsd:float ;\n",
      ".\n",
      "\n",
      "maic:OSB_Panel_12000-2800-25_ShapeAndSize a maic:BoxShape ;\n",
      "maic:dimension_x \"1200\"^^xsd:float ;\n",
      "maic:dimension_y \"2800\"^^xsd:float ;\n",
      "maic:dimension_z \"25\"^^xsd:float ;\n",
      "maic:mass \"420.0\"^^xsd:float ;\n",
      ".\n",
      "\n",
      "maic:OSB_Panel_15000-2800-25_ShapeAndSize a maic:BoxShape ;\n",
      "maic:dimension_x \"15000\"^^xsd:float ;\n",
      "maic:dimension_y \"2800\"^^xsd:float ;\n",
      "maic:dimension_z \"25\"^^xsd:float ;\n",
      "maic:mass \"525.0\"^^xsd:float ;\n",
      ".\n",
      "\n",
      "##################################################################################################################\n",
      "\n",
      "### Section of WorkStation Truck\n",
      "maic:Truck a maic:WorkStation ;\n",
      "maic:consistOf maic:Transport_to_Construction_Crane ;\n",
      "maic:hasCapabilityToProduceType maic:Timber_Frame_Wall_Panel ;\n",
      "maic:hasCapability maic:Road_Transportation ;\n",
      ".\n",
      "\n",
      "### Activities\n",
      "maic:Transport_to_Construction_Crane a maic:Activity ;\n",
      "maic:cycleTime_average \"7200.0\"^^xsd:float ;\n",
      "maic:hasActivityCost: \"200.0\"^^xsd:float ;\n",
      "maic:consumes maic:Truck_Driver ;\n",
      ".\n",
      "\n",
      "### Resources\n",
      "maic:Truck_Driver a maic:Direct_Labour ;\n",
      "maic:hasResourceCost \"200.0\"^^xsd:float ;\n",
      "maic:hasCapability maic:Road_Transportation ;\n",
      ".\n",
      "\n",
      "### Capabilities\n",
      "maic:Road_Transportation a maic:Simple_Capability ;\n",
      "maic:hasAllowedItemShapeAndSize_min maic:Truck_Min_ShapeAndSize ;\n",
      "maic:hasAllowedItemShapeAndSize_max maic:Truck_Max_ShapeAndSize ;\n",
      ".\n",
      "\n",
      "### ShapeAndSizes\n",
      "maic:Truck_Min_ShapeAndSize a maic:BoxShape ;\n",
      "maic:dimension_x \"0.0\"^^xsd:float ;\n",
      "maic:dimension_y \"0.0\"^^xsd:float ;\n",
      "maic:dimension_z \"0.0\"^^xsd:float ;\n",
      "maic:mass \"0.0\"^^xsd:float ;\n",
      ".\n",
      "\n",
      "maic:Truck_Max_ShapeAndSize a maic:BoxShape ;\n",
      "maic:dimension_x \"9200.0\"^^xsd:float ;\n",
      "maic:dimension_y \"3000.0\"^^xsd:float ;\n",
      "maic:dimension_z \"2550.0\"^^xsd:float ;\n",
      "maic:mass \"20000.0\"^^xsd:float ;\n",
      ".\n",
      "\n",
      "\n",
      "\n",
      "##################################################################################################################\n",
      "\n",
      "### Section of WorkStation Construction Crane\n",
      "maic:Construction_Crane a maic:WorkStation ;\n",
      "maic:consistOf maic:Transport_to_Final_Position ;\n",
      "maic:hasCapabilityToProduceType maic:Timber_Frame_Wall_Panel ;\n",
      "maic:hasCapability maic:On_Site_Assembly ;\n",
      ".\n",
      "\n",
      "### Actitivies\n",
      "maic:Transport_to_Final_Position a maic:Activity ;\n",
      "maic:cycleTime_average \"7200.0\"^^xsd:float ;\n",
      "maic:hasActivityCost: \"10.0\"^^xsd:float ;\n",
      "maic:consumes maic:Assembly_Construction_Worker ;\n",
      "maic:consumes maic:Construction_Crane_Operator ;\n",
      ".\n",
      "\n",
      "### Ressources\n",
      "maic:Assembly_Construction_Worker a maic:Direct_Labour ;\n",
      "maic:hasResourceCost \"90.0\"^^xsd:float ;\n",
      "maic:hasCapability maic:On_Site_Assembly ;\n",
      ".\n",
      "\n",
      "maic:Construction_Crane_Operator a maic:Direct_Labour ;\n",
      "maic:hasResourceCost \"30.0\"^^xsd:float ;\n",
      "maic:hasCapability maic:On_Site_Assembly ;\n",
      ".\n",
      "\n",
      "### Capabilities\n",
      "maic:On_Site_Assembly a maic:Simple_Capability ;\n",
      "maic:hasAllowedItemShapeAndSize_min maic:Construction_Crane_Min_ShapeAndSize ;\n",
      "maic:hasAllowedItemShapeAndSize_max maic:Construction_Crane_Max_ShapeAndSize ;\n",
      ".\n",
      "\n",
      "### ShapeAndSizes\n",
      "maic:Construction_Crane_Min_ShapeAndSize a maic:BoxShape;\n",
      "maic:mass \"0.0\"^^xsd:float ;\n",
      ".\n",
      "\n",
      "maic:Construction_Crane_Max_ShapeAndSize a maic:BoxShape;\n",
      "maic:mass \"3000.0\"^^xsd:float ;\n",
      ".\n",
      "\n",
      "\n",
      "\n",
      "##################################################################################################################\n",
      "### Designer's Data\n",
      "##################################################################################################################\n",
      "### Section of Constants\n",
      "maic:Outer_Wall_Panel_Project_Constants a maic:Constant;\n",
      "maic:leadTime \"20000.0\"^^xsd:float;\n",
      ".\n",
      "\n",
      "\n",
      "\n",
      "##################################################################################################################\n",
      "### Section of Product Outer Wall Panel Project\n",
      "maic:Bathroom_Pod_Project a maic:Product ;\n",
      "maic:consistOfComponent maic:Bathroom_Pod ;\n",
      ".\n",
      "\n",
      "\n",
      "\n",
      "##################################################################################################################\n",
      "### Section of Component Bathroom Pod\n",
      "### Components\n",
      "maic:Bathroom_Pod a maic:Component ;\n",
      "maic:hasType maic:Bathroom_Module ;\n",
      ".\n",
      "\n",
      "### Typologies\n",
      "maic:Bathroom_Module a maic:Module ;\n",
      ".\n",
      "\n"
     ]
    }
   ],
   "source": [
    "with open(use_case_manufacturer_path) as file_manufacturer, open(use_case_designer_data_path) as file_designer:\n",
    "    use_case_data = file_manufacturer.read() + file_designer.read()\n",
    "print(use_case_data)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## 0.6 Define manufacturing rules\n",
    "The variables \"SPARQL_rules\" and \"SHACL_rules\" contain the manufacturing rules described in the master thesis \"Manufacturability Analysis for Industrialized Construction\".\n",
    "\n",
    "The amount of feedback information (SHACL Information) can be controlled by choosing another use_case_designer_data_path. Just uncomment another line (but make sure not to comment the line with manufacturing_rules_SPARQL_path)."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 116,
   "metadata": {},
   "outputs": [],
   "source": [
    "# SPARQL Manufacturing rules\n",
    "manufacturing_rules_SPARQL_path = './MAIC_Manufacturing_Rules_SPARQL.txt'\n",
    "\n",
    "# SHACL Manufacturing rules\n",
    "manufacturing_rules_SHACL_path = './MAIC_Manufacturing_Rules_SHACL.txt' # SHACL Warning including all SHACL Info (ComponentMaterialRuleShapeV, ConnectionMaterialRuleShapeIII, DurationRuleShapeII, CostRuleShapeI, CostRuleShapeII, CostRuleShapeIII, CostRuleShapeVI, CostRuleShapeV).\n",
    "# manufacturing_rules_SHACL_path = './MAIC_Manufacturing_Rules_SHACL_with_less_SHACL_info.txt' # SHACL Warning including some SHACL Info (DurationRuleShapeII, CostRuleShapeI, CostRuleShapeII, CostRuleShapeIII, CostRuleShapeVI, CostRuleShapeV).\n",
    "# manufacturing_rules_SHACL_path = './MAIC_Manufacturing_Rules_SHACL_without_SHACL_Info.txt' # SHACL Warning only"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## 0.7 Load manufacturing rules"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 117,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "PREFIX maic: <http://www.semanticweb.org/maic#>\n",
      "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\n",
      "PREFIX owl: <http://www.w3.org/2002/07/owl#>\n",
      "PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\n",
      "PREFIX xsd: <http://www.w3.org/2001/XMLSchema#>\n",
      "\n",
      "\n",
      "\n",
      "##################################################################################################################\n",
      "### Analysis to be used in DirectMaterialRuleShapes\n",
      "##################################################################################################################\n",
      "### Inserts the object property maic:hasSameMaterialTypeProperties to connect Component individuals to Direct_Material individuals if they have the same Typology, materialType, and fireMaterialClassification.\n",
      "### This analysis is to be used in ComponentMaterialRuleShapes.\n",
      "INSERT {\n",
      "    ?component maic:hasSameMaterialTypeProperties ?direct_material\n",
      "}\n",
      "WHERE {\n",
      "    ?component a maic:Component .\n",
      "    ?component maic:hasType ?component_type .\n",
      "    ?component maic:hasMaterialType ?material .\n",
      "    ?material maic:materialType ?component_material_type .\n",
      "    ?material maic:fireMaterialClassification ?component_fire_material_classification .\n",
      "    ?direct_material a maic:Direct_Material .\n",
      "    ?direct_material maic:hasType ?direct_material_type .\n",
      "    ?direct_material maic:materialType ?direct_material_material_type .\n",
      "    ?direct_material maic:fireMaterialClassification ?direct_material_fire_material_classification .\n",
      "    FILTER (?component_type = ?direct_material_type && ?component_material_type = ?direct_material_material_type && ?component_fire_material_classification = ?direct_material_fire_material_classification) .\n",
      "};\n",
      "\n",
      "\n",
      "\n",
      "### Inserts the object property maic:couldBeProducedUsing to connect maic:Component individuals to maic:Direct_Material individuals if they have the equal or larger maic:dimension_x, maic:dimension_y, and maic:dimension_z.\n",
      "### This analysis is to be used in ComponentMaterialRuleShapes.\n",
      "INSERT {\n",
      "    ?component maic:couldBeProducedUsing ?direct_material\n",
      "}\n",
      "WHERE {\n",
      "    ?component a maic:Component .\n",
      "    ?component maic:hasShapeAndSize ?component_shape_and_size .\n",
      "    ?component_shape_and_size maic:dimension_x ?component_dimension_x .\n",
      "    ?component_shape_and_size maic:dimension_y ?component_dimension_y .\n",
      "    ?component_shape_and_size maic:dimension_z ?component_dimension_z .\n",
      "    ?component maic:hasSameMaterialTypeProperties ?direct_material .\n",
      "    ?direct_material maic:hasShapeAndSize ?direct_material_shape_and_size .\n",
      "    ?direct_material_shape_and_size maic:dimension_x ?direct_material_dimension_x .\n",
      "    ?direct_material_shape_and_size maic:dimension_y ?direct_material_dimension_y .\n",
      "    ?direct_material_shape_and_size maic:dimension_z ?direct_material_dimension_z .\n",
      "    FILTER (?component_dimension_x <= ?direct_material_dimension_x && ?component_dimension_y <= ?direct_material_dimension_y && ?component_dimension_z <= ?direct_material_dimension_z) .\n",
      "};\n",
      "\n",
      "\n",
      "\n",
      "### Inserts the object property maic:canBeProducedUsing to connect maic:Component individuals to maic:Direct_Material individuals if their ShapeAndSize can be produced in the construction process.\n",
      "### This analysis is to be used in ComponentMaterialRuleShapes.\n",
      "INSERT {\n",
      "    ?component maic:canBeProducedUsing ?direct_material .\n",
      "}\n",
      "WHERE {\n",
      "    ?component a maic:Component .\n",
      "    ?component maic:hasShapeAndSize ?component_shape_and_size .\n",
      "    ?component_shape_and_size maic:dimension_x ?component_dimension_x .\n",
      "    ?component_shape_and_size maic:dimension_y ?component_dimension_y .\n",
      "    ?component_shape_and_size maic:dimension_z ?component_dimension_z .\n",
      "    ?component maic:couldBeProducedUsing ?direct_material .\n",
      "    ?direct_material maic:hasShapeAndSize ?direct_material_shape_and_size .\n",
      "    ?direct_material_shape_and_size maic:dimension_x ?direct_material_dimension_x .\n",
      "    ?direct_material_shape_and_size maic:dimension_y ?direct_material_dimension_y .\n",
      "    ?direct_material_shape_and_size maic:dimension_z ?direct_material_dimension_z .\n",
      "    ?direct_material maic:hasCapability ?capability .\n",
      "    ?capability maic:hasAllowedNegativeItemShapeAndSize_max ?shape_and_size_max .\n",
      "    ?shape_and_size_max maic:dimension_x ?negative_dimension_x_max .\n",
      "    ?shape_and_size_max maic:dimension_y ?negative_dimension_y_max .\n",
      "    ?shape_and_size_max maic:dimension_z ?negative_dimension_z_max .\n",
      "    ?capability maic:hasAllowedNegativeItemShapeAndSize_min ?shape_and_size_min .\n",
      "    ?shape_and_size_min maic:dimension_x ?negative_dimension_x_min .\n",
      "    ?shape_and_size_min maic:dimension_y ?negative_dimension_y_min .\n",
      "    ?shape_and_size_min maic:dimension_z ?negative_dimension_z_min .\n",
      "    BIND(?direct_material_dimension_z - ?component_dimension_z AS ?foo) .\n",
      "    FILTER ((?direct_material_dimension_x - ?component_dimension_x  <= ?negative_dimension_x_max || ?direct_material_dimension_x - ?component_dimension_x = 0) && (?negative_dimension_x_min <= ?direct_material_dimension_x - ?component_dimension_x || ?direct_material_dimension_x - ?component_dimension_x = 0) && (?direct_material_dimension_y - ?component_dimension_y <= ?negative_dimension_y_max || ?direct_material_dimension_y - ?component_dimension_y = 0) && (?negative_dimension_y_min <= ?direct_material_dimension_y - ?component_dimension_y || ?direct_material_dimension_y - ?component_dimension_y = 0) && (?direct_material_dimension_z - ?component_dimension_z <= ?negative_dimension_z_max || ?direct_material_dimension_z - ?component_dimension_z = 0) && (?negative_dimension_z_min <= ?direct_material_dimension_z - ?component_dimension_z || ?direct_material_dimension_z - ?component_dimension_z = 0)) .\n",
      "};\n",
      "\n",
      "\n",
      "\n",
      "### Inserts the object property maic:canBeProducedUsing to connect maic:Component individuals to maic:Direct_Material individuals if their ShapeAndSize can be delivered to the production process by subcontractors.\n",
      "### This analysis is to be used in ComponentMaterialRuleShapes.\n",
      "INSERT {\n",
      "  ?component maic:canBeProducedUsing ?direct_material .\n",
      "}\n",
      "WHERE {\n",
      "    ?component a maic:Component .\n",
      "    ?component maic:hasSameMaterialTypeProperties ?direct_material .\n",
      "    ?direct_material maic:hasAnyShapeAndSize ?direct_material_has_any_shape_and_size .\n",
      "    FILTER (?direct_material_has_any_shape_and_size = TRUE) .\n",
      "};\n",
      "\n",
      "\n",
      "\n",
      "### Inserts the object property maic:isProducedUsing to connect maic:Component individuals to maic:Direct_Material individuals if a direct material is suited for production and it is the least expensive choice.\n",
      "### This analysis is to be used in ComponentMaterialRuleShapes.\n",
      "INSERT {\n",
      "    ?component maic:isProducedUsing ?direct_material_choice .\n",
      "}\n",
      "WHERE {\n",
      "  {\n",
      "    SELECT ?component (SAMPLE(?direct_material) AS ?direct_material_choice)\n",
      "    WHERE {\n",
      "      ?component a maic:Component .\n",
      "      ?component maic:canBeProducedUsing ?direct_material .\n",
      "      ?direct_material maic:hasResourceCost ?direct_material_cost .\n",
      "      {\n",
      "        SELECT ?component (MIN(?direct_material_cost) AS ?direcet_material_cost_min)\n",
      "        WHERE {\n",
      "          ?component a maic:Component .\n",
      "          ?component maic:canBeProducedUsing ?direct_material .\n",
      "          ?direct_material maic:hasResourceCost ?direct_material_cost .\n",
      "        }\n",
      "        GROUP BY ?component\n",
      "      }\n",
      "      FILTER (?direcet_material_cost_min = ?direct_material_cost) .\n",
      "    }\n",
      "    GROUP BY ?component\n",
      "  }\n",
      "};\n",
      "\n",
      "\n",
      "##################################################################################################################\n",
      "### Analysis to be used in ConnectionRuleShapes\n",
      "##################################################################################################################\n",
      "### Inserts the object property maic:hasSameConnectionTypeProperties to connect maic:Intersection individuals to maic:Direct_Material individuals if they have the same maic:materialType and maic:fireMaterialClassification\n",
      "### This analysis is to be used in ConnectionMaterialRuleShapes.\n",
      "INSERT {\n",
      "    ?intersection maic:canBeProducedUsing ?direct_material .\n",
      "}\n",
      "WHERE {\n",
      "  ?component a maic:Component .\n",
      "  ?component maic:forms ?intersection .\n",
      "  ?intersection maic:connectionType ?intersection_connection_type .\n",
      "  ?component maic:isProducedUsing ?direct_material_chosen .\n",
      "  ?direct_material_chosen maic:hasCapability ?direct_material_chosen_capability .\n",
      "  {\n",
      "  SELECT *\n",
      "  WHERE {\n",
      "    ?direct_material a maic:Direct_Material .\n",
      "    ?direct_material maic:connectionType ?connection_material_connection_type .\n",
      "    ?direct_material maic:hasCapability ?connection_material_capability .\n",
      "    }\n",
      "  }\n",
      "  FILTER(?direct_material_chosen_capability = ?connection_material_capability && ?intersection_connection_type = ?connection_material_connection_type)\n",
      "};\n",
      "\n",
      "\n",
      "\n",
      "### Inserts the object property maic:isProducedUsing to connect maic:Intersection individuals to maic:Direct_Material individuals if a direct material is suited for production and it is the least expensive choice.\n",
      "### This analysis is to be used in ConnectionMaterialRuleShapes.\n",
      "INSERT {\n",
      "    ?intersection maic:isProducedUsing ?direct_material_choice .\n",
      "}\n",
      "WHERE {\n",
      "  {\n",
      "    SELECT ?intersection (SAMPLE(?direct_material) AS ?direct_material_choice)\n",
      "    WHERE {\n",
      "      ?intersection a maic:Component_Intersection .\n",
      "      ?intersection maic:canBeProducedUsing ?direct_material .\n",
      "      ?direct_material maic:hasResourceCost ?direct_material_cost .\n",
      "      {\n",
      "        SELECT ?intersection (MIN(?direct_material_cost) AS ?direcet_material_cost_min)\n",
      "        WHERE {\n",
      "          ?intersection a maic:Component_Intersection .\n",
      "          ?intersection maic:canBeProducedUsing ?direct_material .\n",
      "          ?direct_material maic:hasResourceCost ?direct_material_cost .\n",
      "        }\n",
      "        GROUP BY ?intersection\n",
      "      }\n",
      "      FILTER (?direcet_material_cost_min = ?direct_material_cost) .\n",
      "    }\n",
      "    GROUP BY ?intersection\n",
      "  }\n",
      "}\n",
      "\n"
     ]
    }
   ],
   "source": [
    "with open(manufacturing_rules_SPARQL_path) as file_SPARQL:\n",
    "    manufacturing_rules_SPARQL = file_SPARQL.read()\n",
    "print(manufacturing_rules_SPARQL)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 118,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "PREFIX maic:  <http://www.semanticweb.org/maic#>\n",
      "PREFIX rdf:   <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\n",
      "PREFIX sh:    <http://www.w3.org/ns/shacl#>\n",
      "PREFIX xsd:   <http://www.w3.org/2001/XMLSchema#>\n",
      "PREFIX rdfs:  <http://www.w3.org/2000/01/rdf-schema#>\n",
      "PREFIX owl:   <http://www.w3.org/2002/07/owl#>\n",
      "\n",
      "\n",
      "\n",
      "##################################################################################################################\n",
      "### ProductionProcessRuleShape\n",
      "##################################################################################################################\n",
      "### Checks the rule: The production process must have the capability to produce the type of all components.\n",
      "### Output: Waring if the production process cannot produce the type of the component.\n",
      "maic:ProductionProcessRuleShape rdf:type owl:NamedIndividual , sh:NodeShape ;\n",
      " sh:sparql [\n",
      "  rdf:type sh:SPARQLConstraint ;\n",
      "  sh:message \"There is no work station in the production process to produce {$this}.\" ;\n",
      "  sh:prefixes [\n",
      "   sh:declare [\n",
      "    sh:namespace \"http://www.semanticweb.org/maic#\"^^xsd:anyURI ;\n",
      "    sh:prefix \"maic\"\n",
      "   ]\n",
      "  ] ;\n",
      " sh:select \"\"\"\n",
      " SELECT *\n",
      " WHERE {\n",
      "    {\n",
      "    SELECT $this (SUM(?typology_count) as ?total_typology)\n",
      "    WHERE {\n",
      "        $this maic:hasType ?component_typology .\n",
      "        ?component_typology rdf:type ?component_typology_type .\n",
      "        ?workstation maic:hasCapabilityToProduceType ?workstation_typology .\n",
      "        BIND(IF(?workstation_typology = ?component_typology || ?component_typology_type = maic:Element, 1, 0) AS ?typology_count) .\n",
      "    }\n",
      "    GROUP BY $this\n",
      "    }\n",
      "    FILTER(?total_typology = 0) .\n",
      " }\n",
      " HAVING BOUND($this)\"\"\"\n",
      " ] ;\n",
      " sh:targetClass maic:Component ;\n",
      " sh:severity sh:Warning ;\n",
      " sh:order 1 ;\n",
      " sh:deactivated false ;\n",
      ".\n",
      "\n",
      "\n",
      "\n",
      "##################################################################################################################\n",
      "### ComponentMaterialRuleShapes\n",
      "##################################################################################################################\n",
      "### Checks the rule: The direct material with the same material type and fire classification must be available to the production process.\n",
      "### Output: Warning if there is no direct material with the same material type and fire classification.\n",
      "maic:ComponentMaterialRuleShapeI rdf:type owl:NamedIndividual , sh:NodeShape ;\n",
      " sh:sparql [\n",
      "  rdf:type sh:SPARQLConstraint ;\n",
      "  sh:message \"There is no direct material with material type and fire-protection material classification of {$this}.\" ;\n",
      "  sh:prefixes [\n",
      "   sh:declare [\n",
      "    sh:namespace \"http://www.semanticweb.org/maic#\"^^xsd:anyURI ;\n",
      "    sh:prefix \"maic\"\n",
      "   ]\n",
      "  ] ;\n",
      " sh:select \"\"\"\n",
      " SELECT *\n",
      " WHERE {\n",
      " {\n",
      "  SELECT $this (SUM(?has_suited_direct_material) AS ?direct_material_count)\n",
      "  WHERE {\n",
      "   $this maic:hasMaterialType ?component_material .\n",
      "   ?component_material maic:materialType ?component_material_type .\n",
      "   ?component_material maic:fireMaterialClassification ?component_fire_material_classification .\n",
      "   ?direct_material a maic:Direct_Material .\n",
      "   ?direct_material maic:materialType ?direct_material_material_type .\n",
      "   ?direct_material maic:fireMaterialClassification ?direct_material_fire_material_classification .\n",
      "   BIND(IF(?component_material_type = ?direct_material_material_type && ?component_fire_material_classification = ?direct_material_fire_material_classification, 1, 0) AS ?has_suited_direct_material) .\n",
      "  }\n",
      "  GROUP BY $this\n",
      "  }\n",
      "  FILTER (?direct_material_count = 0) .\n",
      " }\n",
      " HAVING BOUND($this)\"\"\"\n",
      " ] ;\n",
      " sh:targetClass maic:Component ;\n",
      " sh:severity sh:Warning ;\n",
      " sh:order 2 ;\n",
      " sh:deactivated false ;\n",
      ".\n",
      "\n",
      "\n",
      "\n",
      "### Checks the rule: The direct material with the same material type and fire classification must have equal or larger x-, y-, and z-dimension.\n",
      "### Output: Warning if there is no direct material with the same material type and fire classification and equal or larger dimensions.\n",
      "maic:ComponentMaterialRuleShapeII rdf:type owl:NamedIndividual , sh:NodeShape ;\n",
      " sh:sparql [\n",
      "  rdf:type sh:SPARQLConstraint ;\n",
      "  sh:message \"There is no direct material with the same material type and fire classification, which has the same or larger dimensions than {$this}.\" ;\n",
      "  sh:prefixes [\n",
      "   sh:declare [\n",
      "    sh:namespace \"http://www.semanticweb.org/maic#\"^^xsd:anyURI ;\n",
      "    sh:prefix \"maic\"\n",
      "   ]\n",
      "  ] ;\n",
      " sh:select \"\"\"\n",
      " SELECT *\n",
      " WHERE {\n",
      " {\n",
      "  SELECT $this (SUM(?has_suited_direct_material) AS ?direct_material_count)\n",
      "  WHERE {\n",
      "   $this maic:hasShapeAndSize ?component_shape_and_size .\n",
      "   ?component_shape_and_size maic:dimension_x ?component_dimension_x .\n",
      "   ?component_shape_and_size maic:dimension_y ?component_dimension_y .\n",
      "   ?component_shape_and_size maic:dimension_z ?component_dimension_z .\n",
      "   $this maic:hasSameMaterialTypeProperties ?direct_material .\n",
      "   ?direct_material maic:hasShapeAndSize ?direct_material_shape_and_size .\n",
      "   ?direct_material_shape_and_size maic:dimension_x ?direct_material_dimension_x .\n",
      "   ?direct_material_shape_and_size maic:dimension_y ?direct_material_dimension_y .\n",
      "   ?direct_material_shape_and_size maic:dimension_z ?direct_material_dimension_z .\n",
      "   BIND(IF(?component_dimension_x <= ?direct_material_dimension_x && ?component_dimension_y <= ?direct_material_dimension_y && ?component_dimension_z <= ?direct_material_dimension_z, 1, 0) AS ?has_suited_direct_material) .\n",
      "  }\n",
      "  GROUP BY $this\n",
      "  }\n",
      " FILTER (?direct_material_count = 0) .\n",
      " }\n",
      " HAVING BOUND($this)\"\"\"\n",
      " ] ;\n",
      " sh:targetClass maic:Component ;\n",
      " sh:severity sh:Warning ;\n",
      " sh:order 3 ;\n",
      " sh:deactivated false ;\n",
      ".\n",
      "\n",
      "\n",
      "\n",
      "### Checks the rule: The direct material with the same material type, fire classification and equal or larger dimensions must have capabilities with negative item shape and size to create the component's shape and size if their ShapeAndSize can be produced in the construction process.\n",
      "### Output: Warning if there is no direct material with the capability to create the component's shape.\n",
      "maic:ComponentMaterialRuleShapeIII rdf:type owl:NamedIndividual , sh:NodeShape ;\n",
      " sh:sparql [\n",
      "  rdf:type sh:SPARQLConstraint ;\n",
      "  sh:message \"There is no capability in the production process to create {$this} from any direct material.\" ;\n",
      "  sh:prefixes [\n",
      "   sh:declare [\n",
      "    sh:namespace \"http://www.semanticweb.org/maic#\"^^xsd:anyURI ;\n",
      "    sh:prefix \"maic\"\n",
      "   ]\n",
      "  ] ;\n",
      " sh:select \"\"\"\n",
      " SELECT *\n",
      " WHERE {\n",
      " {\n",
      "  SELECT $this (SUM(?has_suited_direct_material) AS ?direct_material_count)\n",
      "  WHERE {\n",
      "   $this maic:hasShapeAndSize ?component_shape_and_size .\n",
      "   ?component_shape_and_size maic:dimension_x ?component_dimension_x .\n",
      "   ?component_shape_and_size maic:dimension_y ?component_dimension_y .\n",
      "   ?component_shape_and_size maic:dimension_z ?component_dimension_z .\n",
      "   $this maic:couldBeProducedUsing ?direct_material .\n",
      "   ?direct_material maic:hasShapeAndSize ?direct_material_shape_and_size .\n",
      "   ?direct_material_shape_and_size maic:dimension_x ?direct_material_dimension_x .\n",
      "   ?direct_material_shape_and_size maic:dimension_y ?direct_material_dimension_y .\n",
      "   ?direct_material_shape_and_size maic:dimension_z ?direct_material_dimension_z .\n",
      "   ?direct_material maic:hasCapability ?capability .\n",
      "   ?capability maic:hasAllowedNegativeItemShapeAndSize_max ?shape_and_size_max .\n",
      "   ?shape_and_size_max maic:dimension_x ?negative_dimension_x_max .\n",
      "   ?shape_and_size_max maic:dimension_y ?negative_dimension_y_max .\n",
      "   ?shape_and_size_max maic:dimension_z ?negative_dimension_z_max .\n",
      "   ?capability maic:hasAllowedNegativeItemShapeAndSize_min ?shape_and_size_min .\n",
      "   ?shape_and_size_min maic:dimension_x ?negative_dimension_x_min .\n",
      "   ?shape_and_size_min maic:dimension_y ?negative_dimension_y_min .\n",
      "   ?shape_and_size_min maic:dimension_z ?negative_dimension_z_min .\n",
      "   BIND(?direct_material_dimension_x - ?component_dimension_x AS ?difference_dimension_x) .\n",
      "   BIND(?direct_material_dimension_y - ?component_dimension_y AS ?difference_dimension_y) .\n",
      "   BIND(?direct_material_dimension_z - ?component_dimension_z AS ?difference_dimension_z) .\n",
      "   BIND(IF((?difference_dimension_x <= ?negative_dimension_x_max && ?negative_dimension_x_min <= ?difference_dimension_x && ?difference_dimension_y <= ?negative_dimension_y_max && ?negative_dimension_y_min <= ?difference_dimension_y && ?difference_dimension_z <= ?negative_dimension_z_max && ?negative_dimension_z_min <= ?difference_dimension_z) || (?difference_dimension_x = 0 &&  ?difference_dimension_y = 0 && ?difference_dimension_z = 0), 1, 0) AS ?has_suited_direct_material) .\n",
      "  }\n",
      "  GROUP BY $this\n",
      "  }\n",
      " FILTER (?direct_material_count = 0) .\n",
      " }\n",
      " HAVING BOUND($this)\"\"\"\n",
      " ] ;\n",
      " sh:targetClass maic:Component ;\n",
      " sh:severity sh:Warning ;\n",
      " sh:order 4 ;\n",
      " sh:deactivated false ;\n",
      ".\n",
      "\n",
      "\n",
      "\n",
      "### Checks the rule: The direct material stock must be equal or larger then the material demanded for components.\n",
      "### Output: Warning if there is too little direct material for the production of all components.\n",
      "maic:ComponentMaterialRuleShapeIV rdf:type owl:NamedIndividual , sh:NodeShape ;\n",
      " sh:sparql [\n",
      "  rdf:type sh:SPARQLConstraint ;\n",
      "  sh:message \"The stock of {$this} is too little for the production of all components.\" ;\n",
      "  sh:prefixes [\n",
      "   sh:declare [\n",
      "    sh:namespace \"http://www.semanticweb.org/maic#\"^^xsd:anyURI ;\n",
      "    sh:prefix \"maic\"\n",
      "   ]\n",
      "  ] ;\n",
      " sh:select \"\"\"\n",
      " SELECT *\n",
      " WHERE {\n",
      " {\n",
      " SELECT $this ?stock_count (COUNT(*) AS ?direct_material_count)\n",
      " WHERE {\n",
      "     ?component a maic:Component .\n",
      "     ?component maic:isProducedUsing ?direct_material .\n",
      "     {\n",
      "       SELECT $this ?stock_count\n",
      "       WHERE {\n",
      "         $this maic:hasCount ?stock_count .\n",
      "       }\n",
      "     }\n",
      "     FILTER(?direct_material = $this) .\n",
      "   }\n",
      "   GROUP BY $this ?stock_count\n",
      " }\n",
      " FILTER (?direct_material_count > ?stock_count) .\n",
      "}\n",
      "HAVING BOUND($this)\"\"\"\n",
      " ] ;\n",
      " sh:targetClass maic:Direct_Material ;\n",
      " sh:severity sh:Warning ;\n",
      " sh:order 5 ;\n",
      " sh:deactivated false ;\n",
      ".\n",
      "\n",
      "\n",
      "\n",
      "### User Information: Displays which direct material is used for the production of a component.\n",
      "### Output: Mapping of components and direct material that can be used for production.\n",
      "maic:ComponentMaterialRuleShapeV rdf:type owl:NamedIndividual , sh:NodeShape ;\n",
      " sh:sparql [\n",
      "  rdf:type sh:SPARQLConstraint ;\n",
      "  sh:message \"{$this} is produced using {?direct_material}.\" ;\n",
      "  sh:prefixes [\n",
      "   sh:declare [\n",
      "    sh:namespace \"http://www.semanticweb.org/maic#\"^^xsd:anyURI ;\n",
      "    sh:prefix \"maic\"\n",
      "   ]\n",
      "  ] ;\n",
      " sh:select \"\"\"\n",
      " SELECT *\n",
      " WHERE {\n",
      " $this maic:isProducedUsing ?direct_material .\n",
      " }\n",
      " HAVING BOUND($this)\"\"\"\n",
      " ] ;\n",
      " sh:targetClass maic:Component ;\n",
      " sh:severity sh:Info ;\n",
      " sh:order 6 ;\n",
      " sh:deactivated false ;\n",
      ".\n",
      "\n",
      "\n",
      "\n",
      "##################################################################################################################\n",
      "### ConnectionMaterialRuleShapes\n",
      "##################################################################################################################\n",
      "### Checks the rule: The direct material with the same connection type must be available to the production process.\n",
      "### Output: Warning if there is no direct material with the same connection type.\n",
      "maic:ConnectionMaterialRuleShapeI rdf:type owl:NamedIndividual , sh:NodeShape ;\n",
      " sh:sparql [\n",
      "  rdf:type sh:SPARQLConstraint ;\n",
      "  sh:message \"There is no direct material with connection type of {$this}.\" ;\n",
      "  sh:prefixes [\n",
      "   sh:declare [\n",
      "    sh:namespace \"http://www.semanticweb.org/maic#\"^^xsd:anyURI ;\n",
      "    sh:prefix \"maic\"\n",
      "   ]\n",
      "  ] ;\n",
      " sh:select \"\"\"\n",
      " SELECT *\n",
      " WHERE {\n",
      " {\n",
      "  SELECT $this (SUM(?has_suited_direct_material) AS ?direct_material_count)\n",
      "  WHERE {\n",
      "   $this maic:connectionType ?intersection_connection_type .\n",
      "   ?direct_material a maic:Direct_Material .\n",
      "   ?direct_material maic:connectionType ?direct_material_connection_type .\n",
      "   BIND(IF(?intersection_connection_type = ?direct_material_connection_type, 1, 0) AS ?has_suited_direct_material) .\n",
      "  }\n",
      "  GROUP BY $this\n",
      "  }\n",
      " FILTER (?direct_material_count = 0) .\n",
      " }\n",
      " HAVING BOUND($this)\"\"\"\n",
      " ] ;\n",
      " sh:targetClass maic:Component_Intersection ;\n",
      " sh:severity sh:Warning ;\n",
      " sh:order 7 ;\n",
      " sh:deactivated false ;\n",
      ".\n",
      "\n",
      "\n",
      "\n",
      "### Checks the rule: The direct material stock must be equal or larger then the material demanded for connections.\n",
      "### Output: Warning if there is too little direct material for the production of all connections.\n",
      "maic:ConnectionMaterialRuleShapeII rdf:type owl:NamedIndividual , sh:NodeShape ;\n",
      " sh:sparql [\n",
      "  rdf:type sh:SPARQLConstraint ;\n",
      "  sh:message \"The stock of {$this} is too little for the production of all components.\" ;\n",
      "  sh:prefixes [\n",
      "   sh:declare [\n",
      "    sh:namespace \"http://www.semanticweb.org/maic#\"^^xsd:anyURI ;\n",
      "    sh:prefix \"maic\"\n",
      "   ]\n",
      "  ] ;\n",
      " sh:select \"\"\"\n",
      " SELECT *\n",
      " WHERE {\n",
      " {\n",
      " SELECT $this ?stock_count_adjusted (COUNT(*) AS ?direct_material_count)\n",
      " WHERE {\n",
      "     ?intersection a maic:Component_Intersection .\n",
      "     ?intersection maic:isProducedUsing ?direct_material .\n",
      "     {\n",
      "       SELECT $this ?stock_count_adjusted\n",
      "       WHERE {\n",
      "         $this maic:hasCount ?stock_count .\n",
      "         $this maic:hasCapability ?capability .\n",
      "         ?capability maic:connectionMaterialIndex ?connection_material_index .\n",
      "         BIND(?stock_count / ?connection_material_index AS ?stock_count_adjusted)\n",
      "       }\n",
      "     }\n",
      "     FILTER(?direct_material = $this) .\n",
      "   }\n",
      "   GROUP BY $this ?stock_count_adjusted\n",
      " }\n",
      " FILTER (?direct_material_count > ?stock_count_adjusted) .\n",
      " }\n",
      " HAVING BOUND($this)\"\"\"\n",
      " ] ;\n",
      " sh:targetClass maic:Direct_Material ;\n",
      " sh:severity sh:Warning ;\n",
      " sh:order 8 ;\n",
      " sh:deactivated false ;\n",
      ".\n",
      "\n",
      "\n",
      "\n",
      "### User Information: Displays which direct material is used for the production of an intersection.\n",
      "### Output: Mapping of intersections and direct material that can be used for production.\n",
      "maic:ConnectionMaterialRuleShapeIII rdf:type owl:NamedIndividual , sh:NodeShape ;\n",
      " sh:sparql [\n",
      "  rdf:type sh:SPARQLConstraint ;\n",
      "  sh:message \"{$this} is produced using {?direct_material}.\" ;\n",
      "  sh:prefixes [\n",
      "   sh:declare [\n",
      "    sh:namespace \"http://www.semanticweb.org/maic#\"^^xsd:anyURI ;\n",
      "    sh:prefix \"maic\"\n",
      "   ]\n",
      "  ] ;\n",
      " sh:select \"\"\"\n",
      " SELECT *\n",
      " WHERE {\n",
      "  $this maic:isProducedUsing ?direct_material .\n",
      " }\n",
      " HAVING BOUND($this)\"\"\"\n",
      " ] ;\n",
      " sh:targetClass maic:Component_Intersection ;\n",
      " sh:severity sh:Info ;\n",
      " sh:order 9 ;\n",
      " sh:deactivated false ;\n",
      ".\n",
      "\n",
      "\n",
      "\n",
      "##################################################################################################################\n",
      "### ShapeAndSizeRuleShapes\n",
      "##################################################################################################################\n",
      "### Checks, the rule: The workstation must be able to handle the shape and size of the component.\n",
      "### Output: Waring if the workstation cannot handle the shape and size of the component.\n",
      "maic:ShapeAndSizeRuleShapeI rdf:type owl:NamedIndividual , sh:NodeShape ;\n",
      " sh:sparql [\n",
      "  rdf:type sh:SPARQLConstraint ;\n",
      "  sh:message \"{$this} cannot handle the shape and size of {?component}.\" ;\n",
      "  sh:prefixes [\n",
      "   sh:declare [\n",
      "    sh:namespace \"http://www.semanticweb.org/maic#\"^^xsd:anyURI ;\n",
      "    sh:prefix \"maic\"\n",
      "   ]\n",
      "  ] ;\n",
      " sh:select \"\"\"\n",
      " SELECT *\n",
      " WHERE {\n",
      "  $this maic:hasCapabilityToProduceType ?workstation_typology .\n",
      "  $this maic:hasCapability ?capability .\n",
      "  ?capability maic:hasAllowedItemShapeAndSize_max ?shape_and_size_max .\n",
      "  ?shape_and_size_max maic:dimension_x ?workstation_dimension_x_max .\n",
      "  ?shape_and_size_max maic:dimension_y ?workstation_dimension_y_max .\n",
      "  ?shape_and_size_max maic:dimension_z ?workstation_dimension_z_max .\n",
      "  ?capability maic:hasAllowedItemShapeAndSize_min ?shape_and_size_min .\n",
      "  ?shape_and_size_min maic:dimension_x ?workstation_dimension_x_min .\n",
      "  ?shape_and_size_min maic:dimension_y ?workstation_dimension_y_min .\n",
      "  ?shape_and_size_min maic:dimension_z ?workstation_dimension_z_min .\n",
      "  ?component a maic:Component.\n",
      "  ?component maic:hasType ?component_typology .\n",
      "  ?component maic:hasShapeAndSize ?component_shape_and_size .\n",
      "  ?component_shape_and_size maic:dimension_x ?component_shape_and_size_dimension_x .\n",
      "  ?component_shape_and_size maic:dimension_y ?component_shape_and_size_dimension_y .\n",
      "  ?component_shape_and_size maic:dimension_z ?component_shape_and_size_dimension_z .\n",
      "  FILTER ( (?workstation_typology = ?component_typology) && (?workstation_dimension_x_min >= ?component_shape_and_size_dimension_x || ?workstation_dimension_y_min >= ?component_shape_and_size_dimension_y || ?workstation_dimension_z_min >= ?component_shape_and_size_dimension_z || ?component_shape_and_size_dimension_x >= ?workstation_dimension_x_max || ?component_shape_and_size_dimension_y >= ?workstation_dimension_y_max || ?component_shape_and_size_dimension_z >= ?workstation_dimension_z_max)) .\n",
      " }\n",
      " HAVING BOUND($this)\"\"\"\n",
      " ] ;\n",
      " sh:targetClass maic:WorkStation ;\n",
      " sh:severity sh:Warning ;\n",
      " sh:order 10 ;\n",
      " sh:deactivated false ;\n",
      ".\n",
      "\n",
      "\n",
      "\n",
      "### Checks, the rule: The workstation must be able to handle the mass of the component.\n",
      "### Output: Waring if the workstation cannot handle the mass of the component.\n",
      "maic:ShapeAndSizeRuleShapeII rdf:type owl:NamedIndividual , sh:NodeShape ;\n",
      " sh:sparql [\n",
      "  rdf:type sh:SPARQLConstraint ;\n",
      "  sh:message \"{$this} cannot handle the mass of {?component}.\" ;\n",
      "  sh:prefixes [\n",
      "   sh:declare [\n",
      "    sh:namespace \"http://www.semanticweb.org/maic#\"^^xsd:anyURI ;\n",
      "    sh:prefix \"maic\"\n",
      "   ]\n",
      "  ] ;\n",
      " sh:select \"\"\"\n",
      "  SELECT *\n",
      "  WHERE {\n",
      "   $this maic:hasCapabilityToProduceType ?workstation_typology .\n",
      "   $this maic:hasCapability ?capability .\n",
      "   ?capability maic:hasAllowedItemShapeAndSize_max ?shape_and_size_max .\n",
      "   ?shape_and_size_max maic:mass ?workstation_mass_max .\n",
      "   ?capability maic:hasAllowedItemShapeAndSize_min ?shape_and_size_min .\n",
      "   ?shape_and_size_min maic:mass ?workstation_mass_min .\n",
      "   ?component a maic:Component.\n",
      "   ?component maic:hasType ?component_typology .\n",
      "   ?component maic:hasShapeAndSize ?component_shape_and_size .\n",
      "   ?component_shape_and_size maic:mass ?component_mass .\n",
      "  FILTER ((?workstation_typology = ?component_typology) && (?workstation_mass_min >= ?component_mass || ?component_mass >= ?workstation_mass_max)) .\n",
      "  }\n",
      "  HAVING BOUND($this)\"\"\"\n",
      " ] ;\n",
      " sh:targetClass maic:WorkStation ;\n",
      " sh:severity sh:Warning ;\n",
      " sh:order 11 ;\n",
      " sh:deactivated false ;\n",
      ".\n",
      "\n",
      "\n",
      "\n",
      "##################################################################################################################\n",
      "### NegativeShapeAndSizeRuleShape\n",
      "##################################################################################################################\n",
      "### Checks the rule: The equipment must be able to create the negative shape and size of the component.\n",
      "### Output: Waring if the equipment cannot create the negative shape and size of the component.\n",
      "maic:NegativeShapeAndSizeRuleShape rdf:type owl:NamedIndividual , sh:NodeShape ;\n",
      " sh:sparql [\n",
      "  rdf:type sh:SPARQLConstraint ;\n",
      "  sh:message \"{?negative_shape_and_size} of {$this} cannot be created by any equipment.\" ;\n",
      "  sh:prefixes [\n",
      "   sh:declare [\n",
      "    sh:namespace \"http://www.semanticweb.org/maic#\"^^xsd:anyURI ;\n",
      "    sh:prefix \"maic\"\n",
      "   ]\n",
      "  ] ;\n",
      " sh:select \"\"\"\n",
      " SELECT *\n",
      " WHERE {\n",
      "  {\n",
      "  SELECT $this (SUM(?negative_item_count) AS ?total_negative_item_count)\n",
      "  WHERE {\n",
      "   $this maic:isProducedUsing ?direct_material .\n",
      "   ?direct_material maic:hasAnyShapeAndSize ?direct_material_has_any_shape_and_size .\n",
      "   ?direct_material maic:hasCapability ?direct_material_capability .\n",
      "   $this maic:hasNegativeShapeAndSize ?negative_shape_and_size .\n",
      "   ?negative_shape_and_size maic:dimension_x ?negative_shape_and_size_dimension_x .\n",
      "   ?negative_shape_and_size maic:dimension_y ?negative_shape_and_size_dimension_y .\n",
      "   ?negative_shape_and_size maic:dimension_z ?negative_shape_and_size_dimension_z .\n",
      "   ?equipment a maic:Direct_Equipment .\n",
      "   ?equipment maic:hasCapability ?equipment_capability .\n",
      "   ?equipment_capability maic:hasAllowedNegativeItemShapeAndSize_max ?shape_and_size_max .\n",
      "   ?shape_and_size_max maic:dimension_x ?capability_dimension_x_max .\n",
      "   ?shape_and_size_max maic:dimension_y ?capability_dimension_y_max .\n",
      "   ?shape_and_size_max maic:dimension_z ?capability_dimension_z_max .\n",
      "   ?equipment_capability maic:hasAllowedNegativeItemShapeAndSize_min ?shape_and_size_min .\n",
      "   ?shape_and_size_min maic:dimension_x ?capability_dimension_x_min .\n",
      "   ?shape_and_size_min maic:dimension_y ?capability_dimension_y_min .\n",
      "   ?shape_and_size_min maic:dimension_z ?capability_dimension_z_min .\n",
      "   BIND(IF(?capability_dimension_x_min <= ?negative_shape_and_size_dimension_x && ?capability_dimension_y_min <= ?negative_shape_and_size_dimension_y && ?capability_dimension_z_min <= ?negative_shape_and_size_dimension_z && ?negative_shape_and_size_dimension_x <= ?capability_dimension_x_max && ?negative_shape_and_size_dimension_y <= ?capability_dimension_y_max && ?negative_shape_and_size_dimension_z <= ?capability_dimension_z_max, 1, 0) AS ?negative_item_count) .\n",
      "   FILTER(?direct_material_has_any_shape_and_size = False && ?direct_material_capability = ?equipment_capability)\n",
      "  }\n",
      "  GROUP BY $this\n",
      " }\n",
      " FILTER(?total_negative_item_count = 0)\n",
      " }\n",
      " HAVING BOUND($this)\"\"\"\n",
      " ] ;\n",
      " sh:targetClass maic:Component ;\n",
      " sh:severity sh:Warning ;\n",
      " sh:order 12 ;\n",
      " sh:deactivated false ;\n",
      ".\n",
      "\n",
      "\n",
      "\n",
      "##################################################################################################################\n",
      "### ToleranceRuleShape\n",
      "##################################################################################################################\n",
      "### Checks the rule: The equipment must be able to achieve the tolerance demanded by all components of the product.\n",
      "### Output: Waring if the equipment cannot achieve the tolerance demanded by all components of the product.\n",
      "maic:ToleranceRuleShape rdf:type owl:NamedIndividual , sh:NodeShape ;\n",
      " sh:sparql [\n",
      "  rdf:type sh:SPARQLConstraint ;\n",
      "  sh:message \"The tolerance of {$this} is lower than the production tolerance.\" ;\n",
      "  sh:prefixes [\n",
      "   sh:declare [\n",
      "    sh:namespace \"http://www.semanticweb.org/maic#\"^^xsd:anyURI ;\n",
      "    sh:prefix \"maic\"\n",
      "   ]\n",
      "  ] ;\n",
      " sh:select \"\"\"\n",
      " SELECT $this\n",
      " WHERE {\n",
      "  $this maic:consistOfIntersection ?intersection .\n",
      "  ?intersection maic:tolerance ?product_tolerance_intersection .\n",
      "  $this maic:consistOfComponent ?component .\n",
      "  ?component maic:hasPerformance ?fire_rating .\n",
      "  ?fire_rating maic:fireSectionClassification ?fire_section_classification .\n",
      "  BIND(IF(?fire_section_classification NOT IN (\"none\"^^xsd:string), \"1.0\"^^xsd:float, \"0.0\"^^xsd:float) AS ?product_tolerance_fire_rating) .\n",
      "  BIND(IF(?product_tolerance_intersection <= ?product_tolerance_fire_rating, ?product_tolerance_intersection, ?product_tolerance_fire_rating) AS ?product_tolerance) .\n",
      "  ?equipment a maic:Direct_Equipment .\n",
      "  ?equipment maic:hasCapability ?capability .\n",
      "  ?capability maic:tolerance ?production_tolerance .\n",
      "  FILTER (?product_tolerance < ?production_tolerance) .\n",
      " }\n",
      " GROUP BY $this\n",
      " HAVING BOUND($this)\"\"\"\n",
      " ] ;\n",
      " sh:targetClass maic:Product ;\n",
      " sh:severity sh:Warning ;\n",
      " sh:order 13 ;\n",
      " sh:deactivated false ;\n",
      ".\n",
      "\n",
      "\n",
      "\n",
      "##################################################################################################################\n",
      "### DurationRuleShapes\n",
      "##################################################################################################################\n",
      "### Checks the rule: The average cycle time of the production process must be equal or less than the lead time demanded.\n",
      "### Output: Waring if the production process exceeds the lead time demanded.\n",
      "maic:DurationRuleShapeI rdf:type owl:NamedIndividual , sh:NodeShape ;\n",
      " sh:sparql [\n",
      "  rdf:type sh:SPARQLConstraint ;\n",
      "  sh:message \"The average cycle time of {?total_cycle_time} seconds of {$this} exeeds the lead time of {?lead_time} seconds.\" ;\n",
      "  sh:prefixes [\n",
      "   sh:declare [\n",
      "    sh:namespace \"http://www.semanticweb.org/maic#\"^^xsd:anyURI ;\n",
      "    sh:prefix \"maic\"\n",
      "   ]\n",
      "  ] ;\n",
      " sh:select \"\"\"\n",
      "  SELECT *\n",
      "  WHERE {\n",
      "  ?constant a maic:Constant .\n",
      "  ?constant maic:leadTime ?lead_time .\n",
      "  {\n",
      "   SELECT  $this (SUM(?cycle_time) AS ?total_cycle_time)\n",
      "   WHERE {\n",
      "    $this maic:consistOf ?workstation .\n",
      "    ?workstation maic:consistOf ?activity .\n",
      "    ?activity maic:cycleTime_average ?cycle_time .\n",
      "  }\n",
      "  GROUP BY $this\n",
      "  }\n",
      "  FILTER (?total_cycle_time > ?lead_time).\n",
      "  }\n",
      "  HAVING BOUND($this)\"\"\"\n",
      " ] ;\n",
      " sh:targetClass maic:Production_Process ;\n",
      " sh:severity sh:Warning ;\n",
      " sh:order 14 ;\n",
      " sh:deactivated false ;\n",
      ".\n",
      "\n",
      "\n",
      "\n",
      "### User Information: Displays the total average cycle time of the production process.\n",
      "### Output: The total average cycle time of the production process.\n",
      "maic:DurationRuleShapeII rdf:type owl:NamedIndividual , sh:NodeShape ;\n",
      " sh:sparql [\n",
      "  rdf:type sh:SPARQLConstraint ;\n",
      "  sh:message \"The average cycle time of {$this} is {?total_cycle_time} seconds.\" ;\n",
      "  sh:prefixes [\n",
      "   sh:declare [\n",
      "    sh:namespace \"http://www.semanticweb.org/maic#\"^^xsd:anyURI ;\n",
      "    sh:prefix \"maic\"\n",
      "   ]\n",
      "  ] ;\n",
      " sh:select \"\"\"\n",
      "   SELECT  $this (SUM(?cycle_time) AS ?total_cycle_time)\n",
      "   WHERE {\n",
      "    $this maic:consistOf ?workstation .\n",
      "    ?workstation maic:consistOf ?activity .\n",
      "    ?activity maic:cycleTime_average ?cycle_time .\n",
      "  }\n",
      "  GROUP BY $this\n",
      "  HAVING BOUND($this)\"\"\"\n",
      " ] ;\n",
      " sh:targetClass maic:Production_Process ;\n",
      " sh:severity sh:Info ;\n",
      " sh:order 15 ;\n",
      " sh:deactivated false ;\n",
      ".\n",
      "\n",
      "\n",
      "\n",
      "##################################################################################################################\n",
      "### CostRuleShapes\n",
      "##################################################################################################################\n",
      "### User Information: Displays the costs of the direct material consumed for components.\n",
      "### Output: The costs of the direct material consumed for components.\n",
      "maic:CostsRuleShapeI rdf:type owl:NamedIndividual , sh:NodeShape ;\n",
      " sh:sparql [\n",
      "  rdf:type sh:SPARQLConstraint ;\n",
      "  sh:message \"The cost for the direct material consumed for components during {$this} is CHF {?total_direct_material_cost}.\" ;\n",
      "  sh:prefixes [\n",
      "   sh:declare [\n",
      "    sh:namespace \"http://www.semanticweb.org/maic#\"^^xsd:anyURI ;\n",
      "    sh:prefix \"maic\"\n",
      "   ]\n",
      "  ] ;\n",
      " sh:select \"\"\"\n",
      "   SELECT $this (SUM(?direct_material_cost) AS ?total_direct_material_cost)\n",
      "   WHERE {\n",
      "   $this maic:consistOfComponent ?component .\n",
      "   ?component maic:isProducedUsing ?direct_material .\n",
      "   ?direct_material maic:hasResourceCost ?direct_material_cost .\n",
      "  }\n",
      "  GROUP BY $this\n",
      "  HAVING BOUND($this)\"\"\"\n",
      " ] ;\n",
      " sh:targetClass maic:Product ;\n",
      " sh:severity sh:Info ;\n",
      " sh:order 16 ;\n",
      " sh:deactivated false ;\n",
      ".\n",
      "\n",
      "\n",
      "\n",
      "### User Information: Displays the costs of the direct material consumed for intersections.\n",
      "### Output: The costs of the direct material consumed for intersections.\n",
      "maic:CostsRuleShapeII rdf:type owl:NamedIndividual , sh:NodeShape ;\n",
      " sh:sparql [\n",
      "  rdf:type sh:SPARQLConstraint ;\n",
      "  sh:message \"The cost for the direct material consumed for intersections during {$this} is CHF {?total_direct_material_cost}.\" ;\n",
      "  sh:prefixes [\n",
      "   sh:declare [\n",
      "    sh:namespace \"http://www.semanticweb.org/maic#\"^^xsd:anyURI ;\n",
      "    sh:prefix \"maic\"\n",
      "   ]\n",
      "  ] ;\n",
      " sh:select \"\"\"\n",
      "   SELECT $this (SUM(?direct_material_cost_adjusted) AS ?total_direct_material_cost)\n",
      "   WHERE {\n",
      "   $this maic:consistOfIntersection ?intersection .\n",
      "   ?intersection maic:isProducedUsing ?direct_material .\n",
      "   ?direct_material maic:hasCapability ?capability .\n",
      "   ?capability maic:connectionMaterialIndex ?connection_material_index .\n",
      "   ?direct_material maic:hasResourceCost ?direct_material_cost .\n",
      "   BIND(?direct_material_cost * ?connection_material_index AS ?direct_material_cost_adjusted) .\n",
      "  }\n",
      "  GROUP BY $this\n",
      "  HAVING BOUND($this)\"\"\"\n",
      " ] ;\n",
      " sh:targetClass maic:Product ;\n",
      " sh:severity sh:Info ;\n",
      " sh:order 17 ;\n",
      " sh:deactivated false ;\n",
      ".\n",
      "\n",
      "\n",
      "\n",
      "### User Information: Displays the costs of the direct equipment consumed.\n",
      "### Output: The costs of the direct equipment consumed.\n",
      "maic:CostsRuleShapeIII rdf:type owl:NamedIndividual , sh:NodeShape ;\n",
      " sh:sparql [\n",
      "  rdf:type sh:SPARQLConstraint ;\n",
      "  sh:message \"The cost of direct equipment consumed during {$this} is CHF {?total_equipment_cost}.\" ;\n",
      "  sh:prefixes [\n",
      "   sh:declare [\n",
      "    sh:namespace \"http://www.semanticweb.org/maic#\"^^xsd:anyURI ;\n",
      "    sh:prefix \"maic\"\n",
      "   ]\n",
      "  ] ;\n",
      " sh:select \"\"\"\n",
      " SELECT $this (SUM(?resource_cost) AS ?total_equipment_cost)\n",
      " WHERE {\n",
      "  $this maic:consistOf ?workstation .\n",
      "  ?workstation maic:consistOf ?activity .\n",
      "  ?activity maic:consumes ?resource .\n",
      "  ?resource maic:hasResourceCost ?resource_cost .\n",
      "  ?resource rdf:type ?resource_type .\n",
      "  FILTER(?resource_type = maic:Direct_Equipment) .\n",
      " }\n",
      " GROUP BY $this\n",
      " HAVING BOUND($this)\"\"\"\n",
      " ] ;\n",
      " sh:targetClass maic:Production_Process ;\n",
      " sh:severity sh:Info ;\n",
      " sh:order 18 ;\n",
      " sh:deactivated false ;\n",
      ".\n",
      "\n",
      "\n",
      "\n",
      "### User Information: Displays the costs of the direct labour consumed.\n",
      "### Output: The costs of the direct labour consumed.\n",
      "maic:CostsRuleShapeIV rdf:type owl:NamedIndividual , sh:NodeShape ;\n",
      " sh:sparql [\n",
      "  rdf:type sh:SPARQLConstraint ;\n",
      "  sh:message \"The cost of direct labour consumed during {$this} is CHF {?total_labour_cost}.\" ;\n",
      "  sh:prefixes [\n",
      "   sh:declare [\n",
      "    sh:namespace \"http://www.semanticweb.org/maic#\"^^xsd:anyURI ;\n",
      "    sh:prefix \"maic\"\n",
      "   ]\n",
      "  ] ;\n",
      " sh:select \"\"\"\n",
      " SELECT $this (SUM(?resource_cost) AS ?total_labour_cost)\n",
      " WHERE {\n",
      "  $this maic:consistOf ?workstation .\n",
      "  ?workstation maic:consistOf ?activity .\n",
      "  ?activity maic:consumes ?resource .\n",
      "  ?resource maic:hasResourceCost ?resource_cost .\n",
      "  ?resource rdf:type ?resource_type .\n",
      "  FILTER(?resource_type = maic:Direct_Labour) .\n",
      " }\n",
      " GROUP BY $this\n",
      " HAVING BOUND($this)\"\"\"\n",
      " ] ;\n",
      " sh:targetClass maic:Production_Process ;\n",
      " sh:severity sh:Info ;\n",
      " sh:order 19 ;\n",
      " sh:deactivated false ;\n",
      ".\n",
      "\n",
      "\n",
      "\n",
      "### User Information: Displays the costs of all activities of the production process.\n",
      "### Output: The  costs of all activities of the production process.\n",
      "maic:CostsRuleShapeV rdf:type owl:NamedIndividual , sh:NodeShape ;\n",
      " sh:sparql [\n",
      "  rdf:type sh:SPARQLConstraint ;\n",
      "  sh:message \"The cost of all activities of {$this} is CHF {?total_activity_cost}.\" ;\n",
      "  sh:prefixes [\n",
      "   sh:declare [\n",
      "    sh:namespace \"http://www.semanticweb.org/maic#\"^^xsd:anyURI ;\n",
      "    sh:prefix \"maic\"\n",
      "   ]\n",
      "  ] ;\n",
      " sh:select \"\"\"\n",
      "   SELECT $this (SUM(?activity_cost) AS ?total_activity_cost)\n",
      "   WHERE {\n",
      "   $this maic:consistOf ?workstation .\n",
      "   ?workstation maic:consistOf ?activity .\n",
      "   ?activity maic:hasActivityCost ?activity_cost .\n",
      "  }\n",
      "  GROUP BY $this\n",
      "  HAVING BOUND($this)\"\"\"\n",
      " ] ;\n",
      " sh:targetClass maic:Production_Process ;\n",
      " sh:severity sh:Info ;\n",
      " sh:order 20 ;\n",
      " sh:deactivated false ;\n",
      ".\n",
      "\n"
     ]
    }
   ],
   "source": [
    "with open(manufacturing_rules_SHACL_path) as file_SHACL:\n",
    "    manufacturing_rules_SHACL = file_SHACL.read()\n",
    "print(manufacturing_rules_SHACL)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "***"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# 1. Webbased approch of use case (implementation on Stardog database)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## 1.1 Specify Stardog connection details\n",
    "Set the variables below to your computer and database settings."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 119,
   "metadata": {},
   "outputs": [],
   "source": [
    "stardog_dir = '/Users/florianschmid/STARDOG_HOME'\n",
    "connection_details = {\n",
    "  'endpoint': 'http://localhost:5820',\n",
    "  'username': 'admin',\n",
    "  'password': 'admin'\n",
    "}"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## 1.2 Create a new database in Stardog"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 120,
   "metadata": {},
   "outputs": [],
   "source": [
    "cwd = os.getcwd()\n",
    "os.chdir(stardog_dir)\n",
    "os.system ('stardog-admin server stop')\n",
    "assert os.system ('stardog-admin server start') == 0\n",
    "os.chdir(cwd)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 121,
   "metadata": {},
   "outputs": [],
   "source": [
    "database_name = 'maic_database'\n",
    "\n",
    "with stardog.Admin(**connection_details) as admin:\n",
    "    if database_name in [db.name for db in admin.databases()]:\n",
    "        admin.database(database_name).drop()\n",
    "    db = admin.new_database(database_name)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## 1.3 Connect to the Stardog database and import MAIC ontology as a schema"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 122,
   "metadata": {},
   "outputs": [],
   "source": [
    "conn = stardog.Connection(database_name, **connection_details)\n",
    "conn.begin()\n",
    "conn.add(stardog.content.File(owl_file_path))\n",
    "conn.commit()"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## 1.4 Import use case data"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 123,
   "metadata": {},
   "outputs": [],
   "source": [
    "conn.begin()\n",
    "conn.add(stardog.content.Raw(use_case_data , content_type = 'text/turtle'))\n",
    "conn.commit()"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## 1.5 Import SPARQL rules"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 124,
   "metadata": {},
   "outputs": [],
   "source": [
    "conn.begin()\n",
    "conn.update(manufacturing_rules_SPARQL)\n",
    "conn.commit()"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## 1.6 Validate the database against the SHACL rules"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 125,
   "metadata": {},
   "outputs": [],
   "source": [
    "icv = stardog.connection.Connection.icv(conn)\n",
    "webbased_validation_result = icv.explain_violations(stardog.content.Raw(manufacturing_rules_SHACL, content_type = 'text/turtle'))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 126,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[b'<?xml version=\"1.0\" encoding=\"UTF-8\"?>\\n<rdf:RDF\\n\\txmlns:rdf=\"http://www.w3.org/1999/02/22-rdf-syntax-ns#\">\\n\\n<rdf:Description rdf:about=\"http://www.semanticweb.org/maic#NegativeShapeAndSizeRuleShape\">\\n\\t<sparql xmlns=\"http://www.w3.org/ns/shacl#\" rdf:nodeID=\"bnode_f5f851d1_6f6c_4387_afea_a7df45edf510_169\"/>\\n</rdf:Description>\\n\\n<rdf:Description rdf:nodeID=\"bnode_f5f851d1_6f6c_4387_afea_a7df45edf510_169\">\\n\\t<prefixes xmlns=\"http://www.w3.org/ns/shacl#\" rdf:nodeID=\"bnode_f5f851d1_6f6c_4387_afea_a7df45edf510_196\"/>\\n\\t<message xmlns=\"http://www.w3.org/ns/shacl#\" rdf:datatype=\"http://www.w3.org/2001/XMLSchema#string\">{?negative_shape_and_size} of {$this} cannot be created by any equipment.</message>\\n</rdf:Description>\\n\\n<rdf:Description rdf:nodeID=\"bnode_f5f851d1_6f6c_4387_afea_a7df45edf510_196\">\\n\\t<declare xmlns=\"http://www.w3.org/ns/shacl#\" rdf:nodeID=\"bnode_f5f851d1_6f6c_4387_afea_a7df45edf510_197\"/>\\n</rdf:Description>\\n\\n<rdf:Description rdf:nodeID=\"bnode_f5f851d1_6f6c_4387_afea_a7df45edf510_169\">\\n\\t<select xmlns=\"http://www.w3.org/ns/shacl#\" rdf:datatype=\"http://www.w3.org/2001/XMLSchema#string\">\\n SELECT *\\n WHERE {\\n  {\\n  SELECT $this (SUM(?negative_item_count) AS ?total_negative_item_count)\\n  WHERE {\\n   $this maic:isProducedUsing ?direct_material .\\n   ?direct_material maic:hasAnyShapeAndSize ?direct_material_has_any_shape_and_size .\\n   ?direct_material maic:hasCapability ?direct_material_capability .\\n   $this maic:hasNegativeShapeAndSize ?negative_shape_and_size .\\n   ?negative_shape_and_size maic:dimension_x ?negative_shape_and_size_dimension_x .\\n   ?negative_shape_and_size maic:dimension_y ?negative_shape_and_size_dimension_y .\\n   ?negative_shape_and_size maic:dimension_z ?negative_shape_and_size_dimension_z .\\n   ?equipment a maic:Direct_Equipment .\\n   ?equipment maic:hasCapability ?equipment_capability .\\n   ?equipment_capability maic:hasAllowedNegativeItemShapeAndSize_max ?shape_and_size_max .\\n   ?shape_and_size_max maic:dimension_x ?capability_dimension_x_max .\\n   ?shape_and_size_max maic:dimension_y ?capability_dimension_y_max .\\n   ?shape_and_size_max maic:dimension_z ?capability_dimension_z_max .\\n   ?equipment_capability maic:hasAllowedNegativeItemShapeAndSize_min ?shape_and_size_min .\\n   ?shape_and_size_min maic:dimension_x ?capability_dimension_x_min .\\n   ?shape_and_size_min maic:dimension_y ?capability_dimension_y_min .\\n   ?shape_and_size_min maic:dimension_z ?capability_dimension_z_min .\\n   BIND(IF(?capability_dimension_x_min &lt;= ?negative_shape_and_size_dimension_x &amp;&amp; ?capability_dimension_y_min &lt;= ?negative_shape_and_size_dimension_y &amp;&amp; ?capability_dimension_z_min &lt;= ?negative_shape_and_size_dimension_z &amp;&amp; ?negative_shape_and_size_dimension_x &lt;= ?capability_dimension_x_max &amp;&amp; ?negative_shape_and_size_dimension_y &lt;= ?capability_dimension_y_max &amp;&amp; ?negative_shape_and_size_dimension_z &lt;= ?capability_dimension_z_max, 1, 0) AS ?negative_item_count) .\\n   FILTER(?direct_material_has_any_shape_and_size = False &amp;&amp; ?direct_material_capability = ?equipment_capability)\\n  }\\n  GROUP BY $this\\n }\\n FILTER(?total_negative_item_count = 0)\\n }\\n HAVING BOUND($this)</select>\\n</rdf:Description>\\n\\n<rdf:Description rdf:nodeID=\"bnode_f5f851d1_6f6c_4387_afea_a7df45edf510_197\">\\n\\t<namespace xmlns=\"http://www.w3.org/ns/shacl#\" rdf:datatype=\"http://www.w3.org/2001/XMLSchema#anyURI\">http://www.semanticweb.org/maic#</namespace>\\n\\t<prefix xmlns=\"http://www.w3.org/ns/shacl#\" rdf:datatype=\"http://www.w3.org/2001/XMLSchema#string\">maic</prefix>\\n</rdf:Description>\\n\\n<rdf:Description rdf:about=\"http://www.semanticweb.org/maic#NegativeShapeAndSizeRuleShape\">\\n\\t<rdf:type rdf:resource=\"http://www.w3.org/ns/shacl#NodeShape\"/>\\n\\t<severity xmlns=\"http://www.w3.org/ns/shacl#\" rdf:resource=\"http://www.w3.org/ns/shacl#Warning\"/>\\n\\t<targetClass xmlns=\"http://www.w3.org/ns/shacl#\" rdf:resource=\"http://www.semanticweb.org/maic#Component\"/>\\n</rdf:Description>\\n\\n</rdf:RDF>\\r\\n',\n",
       " b\"<?xml version='1.0' encoding='UTF-8'?><sparql xmlns='http://www.w3.org/2005/sparql-results#'><head><variable name='severity'/><variable name='component'/><variable name='shape'/><variable name='this'/><variable name='constraint'/><variable name='message'/><variable name='valueNode___'/></head><results><result><binding name='severity'><uri>http://www.w3.org/ns/shacl#Warning</uri></binding><binding name='component'><uri>http://www.w3.org/ns/shacl#SPARQLConstraintComponent</uri></binding><binding name='shape'><uri>http://www.semanticweb.org/maic#NegativeShapeAndSizeRuleShape</uri></binding><binding name='this'><uri>http://www.semanticweb.org/maic#Bathroom_Pod</uri></binding><binding name='constraint'><bnode>bnode_f5f851d1_6f6c_4387_afea_a7df45edf510_169</bnode></binding><binding name='message'><literal>{?negative_shape_and_size} of {$this} cannot be created by any equipment.</literal></binding><binding name='valueNode___'><uri>http://www.semanticweb.org/maic#Bathroom_Pod</uri></binding></result></results></sparql>\\r\\n\",\n",
       " b'<?xml version=\"1.0\" encoding=\"UTF-8\"?>\\n<rdf:RDF\\n\\txmlns:rdf=\"http://www.w3.org/1999/02/22-rdf-syntax-ns#\">\\n\\n<rdf:Description rdf:nodeID=\"bnode_f5f851d1_6f6c_4387_afea_a7df45edf510_199\">\\n\\t<prefix xmlns=\"http://www.w3.org/ns/shacl#\" rdf:datatype=\"http://www.w3.org/2001/XMLSchema#string\">maic</prefix>\\n</rdf:Description>\\n\\n<rdf:Description rdf:nodeID=\"bnode_f5f851d1_6f6c_4387_afea_a7df45edf510_145\">\\n\\t<message xmlns=\"http://www.w3.org/ns/shacl#\" rdf:datatype=\"http://www.w3.org/2001/XMLSchema#string\">There is no capability in the production process to create {$this} from any direct material.</message>\\n\\t<prefixes xmlns=\"http://www.w3.org/ns/shacl#\" rdf:nodeID=\"bnode_f5f851d1_6f6c_4387_afea_a7df45edf510_198\"/>\\n</rdf:Description>\\n\\n<rdf:Description rdf:about=\"http://www.semanticweb.org/maic#ComponentMaterialRuleShapeIII\">\\n\\t<sparql xmlns=\"http://www.w3.org/ns/shacl#\" rdf:nodeID=\"bnode_f5f851d1_6f6c_4387_afea_a7df45edf510_145\"/>\\n</rdf:Description>\\n\\n<rdf:Description rdf:nodeID=\"bnode_f5f851d1_6f6c_4387_afea_a7df45edf510_145\">\\n\\t<select xmlns=\"http://www.w3.org/ns/shacl#\" rdf:datatype=\"http://www.w3.org/2001/XMLSchema#string\">\\n SELECT *\\n WHERE {\\n {\\n  SELECT $this (SUM(?has_suited_direct_material) AS ?direct_material_count)\\n  WHERE {\\n   $this maic:hasShapeAndSize ?component_shape_and_size .\\n   ?component_shape_and_size maic:dimension_x ?component_dimension_x .\\n   ?component_shape_and_size maic:dimension_y ?component_dimension_y .\\n   ?component_shape_and_size maic:dimension_z ?component_dimension_z .\\n   $this maic:couldBeProducedUsing ?direct_material .\\n   ?direct_material maic:hasShapeAndSize ?direct_material_shape_and_size .\\n   ?direct_material_shape_and_size maic:dimension_x ?direct_material_dimension_x .\\n   ?direct_material_shape_and_size maic:dimension_y ?direct_material_dimension_y .\\n   ?direct_material_shape_and_size maic:dimension_z ?direct_material_dimension_z .\\n   ?direct_material maic:hasCapability ?capability .\\n   ?capability maic:hasAllowedNegativeItemShapeAndSize_max ?shape_and_size_max .\\n   ?shape_and_size_max maic:dimension_x ?negative_dimension_x_max .\\n   ?shape_and_size_max maic:dimension_y ?negative_dimension_y_max .\\n   ?shape_and_size_max maic:dimension_z ?negative_dimension_z_max .\\n   ?capability maic:hasAllowedNegativeItemShapeAndSize_min ?shape_and_size_min .\\n   ?shape_and_size_min maic:dimension_x ?negative_dimension_x_min .\\n   ?shape_and_size_min maic:dimension_y ?negative_dimension_y_min .\\n   ?shape_and_size_min maic:dimension_z ?negative_dimension_z_min .\\n   BIND(?direct_material_dimension_x - ?component_dimension_x AS ?difference_dimension_x) .\\n   BIND(?direct_material_dimension_y - ?component_dimension_y AS ?difference_dimension_y) .\\n   BIND(?direct_material_dimension_z - ?component_dimension_z AS ?difference_dimension_z) .\\n   BIND(IF((?difference_dimension_x &lt;= ?negative_dimension_x_max &amp;&amp; ?negative_dimension_x_min &lt;= ?difference_dimension_x &amp;&amp; ?difference_dimension_y &lt;= ?negative_dimension_y_max &amp;&amp; ?negative_dimension_y_min &lt;= ?difference_dimension_y &amp;&amp; ?difference_dimension_z &lt;= ?negative_dimension_z_max &amp;&amp; ?negative_dimension_z_min &lt;= ?difference_dimension_z) || (?difference_dimension_x = 0 &amp;&amp;  ?difference_dimension_y = 0 &amp;&amp; ?difference_dimension_z = 0), 1, 0) AS ?has_suited_direct_material) .\\n  }\\n  GROUP BY $this\\n  }\\n FILTER (?direct_material_count = 0) .\\n }\\n HAVING BOUND($this)</select>\\n</rdf:Description>\\n\\n<rdf:Description rdf:nodeID=\"bnode_f5f851d1_6f6c_4387_afea_a7df45edf510_198\">\\n\\t<declare xmlns=\"http://www.w3.org/ns/shacl#\" rdf:nodeID=\"bnode_f5f851d1_6f6c_4387_afea_a7df45edf510_199\"/>\\n</rdf:Description>\\n\\n<rdf:Description rdf:nodeID=\"bnode_f5f851d1_6f6c_4387_afea_a7df45edf510_199\">\\n\\t<namespace xmlns=\"http://www.w3.org/ns/shacl#\" rdf:datatype=\"http://www.w3.org/2001/XMLSchema#anyURI\">http://www.semanticweb.org/maic#</namespace>\\n</rdf:Description>\\n\\n<rdf:Description rdf:about=\"http://www.semanticweb.org/maic#ComponentMaterialRuleShapeIII\">\\n\\t<rdf:type rdf:resource=\"http://www.w3.org/ns/shacl#NodeShape\"/>\\n\\t<severity xmlns=\"http://www.w3.org/ns/shacl#\" rdf:resource=\"http://www.w3.org/ns/shacl#Warning\"/>\\n\\t<targetClass xmlns=\"http://www.w3.org/ns/shacl#\" rdf:resource=\"http://www.semanticweb.org/maic#Component\"/>\\n</rdf:Description>\\n\\n</rdf:RDF>\\r\\n',\n",
       " b\"<?xml version='1.0' encoding='UTF-8'?><sparql xmlns='http://www.w3.org/2005/sparql-results#'><head><variable name='severity'/><variable name='component'/><variable name='shape'/><variable name='this'/><variable name='constraint'/><variable name='message'/><variable name='valueNode___'/></head><results><result><binding name='severity'><uri>http://www.w3.org/ns/shacl#Warning</uri></binding><binding name='component'><uri>http://www.w3.org/ns/shacl#SPARQLConstraintComponent</uri></binding><binding name='shape'><uri>http://www.semanticweb.org/maic#ComponentMaterialRuleShapeIII</uri></binding><binding name='this'><uri>http://www.semanticweb.org/maic#Bathroom_Pod</uri></binding><binding name='constraint'><bnode>bnode_f5f851d1_6f6c_4387_afea_a7df45edf510_145</bnode></binding><binding name='message'><literal>There is no capability in the production process to create {$this} from any direct material.</literal></binding><binding name='valueNode___'><uri>http://www.semanticweb.org/maic#Bathroom_Pod</uri></binding></result></results></sparql>\\r\\n\",\n",
       " b'<?xml version=\"1.0\" encoding=\"UTF-8\"?>\\n<rdf:RDF\\n\\txmlns:rdf=\"http://www.w3.org/1999/02/22-rdf-syntax-ns#\">\\n\\n<rdf:Description rdf:about=\"http://www.semanticweb.org/maic#ComponentMaterialRuleShapeII\">\\n\\t<severity xmlns=\"http://www.w3.org/ns/shacl#\" rdf:resource=\"http://www.w3.org/ns/shacl#Warning\"/>\\n</rdf:Description>\\n\\n<rdf:Description rdf:nodeID=\"bnode_f5f851d1_6f6c_4387_afea_a7df45edf510_200\">\\n\\t<declare xmlns=\"http://www.w3.org/ns/shacl#\" rdf:nodeID=\"bnode_f5f851d1_6f6c_4387_afea_a7df45edf510_201\"/>\\n</rdf:Description>\\n\\n<rdf:Description rdf:nodeID=\"bnode_f5f851d1_6f6c_4387_afea_a7df45edf510_142\">\\n\\t<select xmlns=\"http://www.w3.org/ns/shacl#\" rdf:datatype=\"http://www.w3.org/2001/XMLSchema#string\">\\n SELECT *\\n WHERE {\\n {\\n  SELECT $this (SUM(?has_suited_direct_material) AS ?direct_material_count)\\n  WHERE {\\n   $this maic:hasShapeAndSize ?component_shape_and_size .\\n   ?component_shape_and_size maic:dimension_x ?component_dimension_x .\\n   ?component_shape_and_size maic:dimension_y ?component_dimension_y .\\n   ?component_shape_and_size maic:dimension_z ?component_dimension_z .\\n   $this maic:hasSameMaterialTypeProperties ?direct_material .\\n   ?direct_material maic:hasShapeAndSize ?direct_material_shape_and_size .\\n   ?direct_material_shape_and_size maic:dimension_x ?direct_material_dimension_x .\\n   ?direct_material_shape_and_size maic:dimension_y ?direct_material_dimension_y .\\n   ?direct_material_shape_and_size maic:dimension_z ?direct_material_dimension_z .\\n   BIND(IF(?component_dimension_x &lt;= ?direct_material_dimension_x &amp;&amp; ?component_dimension_y &lt;= ?direct_material_dimension_y &amp;&amp; ?component_dimension_z &lt;= ?direct_material_dimension_z, 1, 0) AS ?has_suited_direct_material) .\\n  }\\n  GROUP BY $this\\n  }\\n FILTER (?direct_material_count = 0) .\\n }\\n HAVING BOUND($this)</select>\\n</rdf:Description>\\n\\n<rdf:Description rdf:nodeID=\"bnode_f5f851d1_6f6c_4387_afea_a7df45edf510_201\">\\n\\t<namespace xmlns=\"http://www.w3.org/ns/shacl#\" rdf:datatype=\"http://www.w3.org/2001/XMLSchema#anyURI\">http://www.semanticweb.org/maic#</namespace>\\n</rdf:Description>\\n\\n<rdf:Description rdf:about=\"http://www.semanticweb.org/maic#ComponentMaterialRuleShapeII\">\\n\\t<sparql xmlns=\"http://www.w3.org/ns/shacl#\" rdf:nodeID=\"bnode_f5f851d1_6f6c_4387_afea_a7df45edf510_142\"/>\\n</rdf:Description>\\n\\n<rdf:Description rdf:nodeID=\"bnode_f5f851d1_6f6c_4387_afea_a7df45edf510_142\">\\n\\t<prefixes xmlns=\"http://www.w3.org/ns/shacl#\" rdf:nodeID=\"bnode_f5f851d1_6f6c_4387_afea_a7df45edf510_200\"/>\\n</rdf:Description>\\n\\n<rdf:Description rdf:about=\"http://www.semanticweb.org/maic#ComponentMaterialRuleShapeII\">\\n\\t<rdf:type rdf:resource=\"http://www.w3.org/ns/shacl#NodeShape\"/>\\n\\t<targetClass xmlns=\"http://www.w3.org/ns/shacl#\" rdf:resource=\"http://www.semanticweb.org/maic#Component\"/>\\n</rdf:Description>\\n\\n<rdf:Description rdf:nodeID=\"bnode_f5f851d1_6f6c_4387_afea_a7df45edf510_142\">\\n\\t<message xmlns=\"http://www.w3.org/ns/shacl#\" rdf:datatype=\"http://www.w3.org/2001/XMLSchema#string\">There is no direct material with the same material type and fire classification, which has the same or larger dimensions than {$this}.</message>\\n</rdf:Description>\\n\\n<rdf:Description rdf:nodeID=\"bnode_f5f851d1_6f6c_4387_afea_a7df45edf510_201\">\\n\\t<prefix xmlns=\"http://www.w3.org/ns/shacl#\" rdf:datatype=\"http://www.w3.org/2001/XMLSchema#string\">maic</prefix>\\n</rdf:Description>\\n\\n</rdf:RDF>\\r\\n',\n",
       " b\"<?xml version='1.0' encoding='UTF-8'?><sparql xmlns='http://www.w3.org/2005/sparql-results#'><head><variable name='severity'/><variable name='component'/><variable name='shape'/><variable name='this'/><variable name='constraint'/><variable name='message'/><variable name='valueNode___'/></head><results><result><binding name='severity'><uri>http://www.w3.org/ns/shacl#Warning</uri></binding><binding name='component'><uri>http://www.w3.org/ns/shacl#SPARQLConstraintComponent</uri></binding><binding name='shape'><uri>http://www.semanticweb.org/maic#ComponentMaterialRuleShapeII</uri></binding><binding name='this'><uri>http://www.semanticweb.org/maic#Bathroom_Pod</uri></binding><binding name='constraint'><bnode>bnode_f5f851d1_6f6c_4387_afea_a7df45edf510_142</bnode></binding><binding name='message'><literal>There is no direct material with the same material type and fire classification, which has the same or larger dimensions than {$this}.</literal></binding><binding name='valueNode___'><uri>http://www.semanticweb.org/maic#Bathroom_Pod</uri></binding></result></results></sparql>\\r\\n\",\n",
       " b'<?xml version=\"1.0\" encoding=\"UTF-8\"?>\\n<rdf:RDF\\n\\txmlns:rdf=\"http://www.w3.org/1999/02/22-rdf-syntax-ns#\">\\n\\n<rdf:Description rdf:about=\"http://www.semanticweb.org/maic#CostsRuleShapeV\">\\n\\t<severity xmlns=\"http://www.w3.org/ns/shacl#\" rdf:resource=\"http://www.w3.org/ns/shacl#Info\"/>\\n\\t<sparql xmlns=\"http://www.w3.org/ns/shacl#\" rdf:nodeID=\"bnode_f5f851d1_6f6c_4387_afea_a7df45edf510_193\"/>\\n</rdf:Description>\\n\\n<rdf:Description rdf:nodeID=\"bnode_f5f851d1_6f6c_4387_afea_a7df45edf510_193\">\\n\\t<message xmlns=\"http://www.w3.org/ns/shacl#\" rdf:datatype=\"http://www.w3.org/2001/XMLSchema#string\">The cost of all activities of {$this} is CHF {?total_activity_cost}.</message>\\n</rdf:Description>\\n\\n<rdf:Description rdf:nodeID=\"bnode_f5f851d1_6f6c_4387_afea_a7df45edf510_203\">\\n\\t<namespace xmlns=\"http://www.w3.org/ns/shacl#\" rdf:datatype=\"http://www.w3.org/2001/XMLSchema#anyURI\">http://www.semanticweb.org/maic#</namespace>\\n</rdf:Description>\\n\\n<rdf:Description rdf:nodeID=\"bnode_f5f851d1_6f6c_4387_afea_a7df45edf510_193\">\\n\\t<select xmlns=\"http://www.w3.org/ns/shacl#\" rdf:datatype=\"http://www.w3.org/2001/XMLSchema#string\">\\n   SELECT $this (SUM(?activity_cost) AS ?total_activity_cost)\\n   WHERE {\\n   $this maic:consistOf ?workstation .\\n   ?workstation maic:consistOf ?activity .\\n   ?activity maic:hasActivityCost ?activity_cost .\\n  }\\n  GROUP BY $this\\n  HAVING BOUND($this)</select>\\n</rdf:Description>\\n\\n<rdf:Description rdf:about=\"http://www.semanticweb.org/maic#CostsRuleShapeV\">\\n\\t<targetClass xmlns=\"http://www.w3.org/ns/shacl#\" rdf:resource=\"http://www.semanticweb.org/maic#Production_Process\"/>\\n\\t<rdf:type rdf:resource=\"http://www.w3.org/ns/shacl#NodeShape\"/>\\n</rdf:Description>\\n\\n<rdf:Description rdf:nodeID=\"bnode_f5f851d1_6f6c_4387_afea_a7df45edf510_202\">\\n\\t<declare xmlns=\"http://www.w3.org/ns/shacl#\" rdf:nodeID=\"bnode_f5f851d1_6f6c_4387_afea_a7df45edf510_203\"/>\\n</rdf:Description>\\n\\n<rdf:Description rdf:nodeID=\"bnode_f5f851d1_6f6c_4387_afea_a7df45edf510_203\">\\n\\t<prefix xmlns=\"http://www.w3.org/ns/shacl#\" rdf:datatype=\"http://www.w3.org/2001/XMLSchema#string\">maic</prefix>\\n</rdf:Description>\\n\\n<rdf:Description rdf:nodeID=\"bnode_f5f851d1_6f6c_4387_afea_a7df45edf510_193\">\\n\\t<prefixes xmlns=\"http://www.w3.org/ns/shacl#\" rdf:nodeID=\"bnode_f5f851d1_6f6c_4387_afea_a7df45edf510_202\"/>\\n</rdf:Description>\\n\\n</rdf:RDF>\\r\\n',\n",
       " b\"<?xml version='1.0' encoding='UTF-8'?><sparql xmlns='http://www.w3.org/2005/sparql-results#'><head><variable name='severity'/><variable name='component'/><variable name='shape'/><variable name='this'/><variable name='constraint'/><variable name='message'/><variable name='valueNode___'/></head><results><result><binding name='severity'><uri>http://www.w3.org/ns/shacl#Info</uri></binding><binding name='component'><uri>http://www.w3.org/ns/shacl#SPARQLConstraintComponent</uri></binding><binding name='shape'><uri>http://www.semanticweb.org/maic#CostsRuleShapeV</uri></binding><binding name='this'><uri>http://www.semanticweb.org/maic#ERNEs_Weinmann_Production_Process</uri></binding><binding name='constraint'><bnode>bnode_f5f851d1_6f6c_4387_afea_a7df45edf510_193</bnode></binding><binding name='message'><literal>The cost of all activities of {$this} is CHF {?total_activity_cost}.</literal></binding><binding name='valueNode___'><uri>http://www.semanticweb.org/maic#ERNEs_Weinmann_Production_Process</uri></binding></result></results></sparql>\\r\\n\",\n",
       " b'<?xml version=\"1.0\" encoding=\"UTF-8\"?>\\n<rdf:RDF\\n\\txmlns:rdf=\"http://www.w3.org/1999/02/22-rdf-syntax-ns#\">\\n\\n<rdf:Description rdf:nodeID=\"bnode_f5f851d1_6f6c_4387_afea_a7df45edf510_172\">\\n\\t<message xmlns=\"http://www.w3.org/ns/shacl#\" rdf:datatype=\"http://www.w3.org/2001/XMLSchema#string\">The tolerance of {$this} is lower than the production tolerance.</message>\\n</rdf:Description>\\n\\n<rdf:Description rdf:about=\"http://www.semanticweb.org/maic#ToleranceRuleShape\">\\n\\t<targetClass xmlns=\"http://www.w3.org/ns/shacl#\" rdf:resource=\"http://www.semanticweb.org/maic#Product\"/>\\n</rdf:Description>\\n\\n<rdf:Description rdf:nodeID=\"bnode_f5f851d1_6f6c_4387_afea_a7df45edf510_204\">\\n\\t<declare xmlns=\"http://www.w3.org/ns/shacl#\" rdf:nodeID=\"bnode_f5f851d1_6f6c_4387_afea_a7df45edf510_205\"/>\\n</rdf:Description>\\n\\n<rdf:Description rdf:about=\"http://www.semanticweb.org/maic#ToleranceRuleShape\">\\n\\t<rdf:type rdf:resource=\"http://www.w3.org/ns/shacl#NodeShape\"/>\\n\\t<sparql xmlns=\"http://www.w3.org/ns/shacl#\" rdf:nodeID=\"bnode_f5f851d1_6f6c_4387_afea_a7df45edf510_172\"/>\\n</rdf:Description>\\n\\n<rdf:Description rdf:nodeID=\"bnode_f5f851d1_6f6c_4387_afea_a7df45edf510_205\">\\n\\t<namespace xmlns=\"http://www.w3.org/ns/shacl#\" rdf:datatype=\"http://www.w3.org/2001/XMLSchema#anyURI\">http://www.semanticweb.org/maic#</namespace>\\n</rdf:Description>\\n\\n<rdf:Description rdf:about=\"http://www.semanticweb.org/maic#ToleranceRuleShape\">\\n\\t<severity xmlns=\"http://www.w3.org/ns/shacl#\" rdf:resource=\"http://www.w3.org/ns/shacl#Warning\"/>\\n</rdf:Description>\\n\\n<rdf:Description rdf:nodeID=\"bnode_f5f851d1_6f6c_4387_afea_a7df45edf510_172\">\\n\\t<select xmlns=\"http://www.w3.org/ns/shacl#\" rdf:datatype=\"http://www.w3.org/2001/XMLSchema#string\">\\n SELECT $this\\n WHERE {\\n  $this maic:consistOfIntersection ?intersection .\\n  ?intersection maic:tolerance ?product_tolerance_intersection .\\n  $this maic:consistOfComponent ?component .\\n  ?component maic:hasPerformance ?fire_rating .\\n  ?fire_rating maic:fireSectionClassification ?fire_section_classification .\\n  BIND(IF(?fire_section_classification NOT IN (\"none\"^^xsd:string), \"1.0\"^^xsd:float, \"0.0\"^^xsd:float) AS ?product_tolerance_fire_rating) .\\n  BIND(IF(?product_tolerance_intersection &lt;= ?product_tolerance_fire_rating, ?product_tolerance_intersection, ?product_tolerance_fire_rating) AS ?product_tolerance) .\\n  ?equipment a maic:Direct_Equipment .\\n  ?equipment maic:hasCapability ?capability .\\n  ?capability maic:tolerance ?production_tolerance .\\n  FILTER (?product_tolerance &lt; ?production_tolerance) .\\n }\\n GROUP BY $this\\n HAVING BOUND($this)</select>\\n\\t<prefixes xmlns=\"http://www.w3.org/ns/shacl#\" rdf:nodeID=\"bnode_f5f851d1_6f6c_4387_afea_a7df45edf510_204\"/>\\n</rdf:Description>\\n\\n<rdf:Description rdf:nodeID=\"bnode_f5f851d1_6f6c_4387_afea_a7df45edf510_205\">\\n\\t<prefix xmlns=\"http://www.w3.org/ns/shacl#\" rdf:datatype=\"http://www.w3.org/2001/XMLSchema#string\">maic</prefix>\\n</rdf:Description>\\n\\n</rdf:RDF>\\r\\n',\n",
       " b\"<?xml version='1.0' encoding='UTF-8'?><sparql xmlns='http://www.w3.org/2005/sparql-results#'><head><variable name='severity'/><variable name='component'/><variable name='shape'/><variable name='this'/><variable name='constraint'/><variable name='message'/><variable name='valueNode___'/></head><results><result><binding name='severity'><uri>http://www.w3.org/ns/shacl#Warning</uri></binding><binding name='component'><uri>http://www.w3.org/ns/shacl#SPARQLConstraintComponent</uri></binding><binding name='shape'><uri>http://www.semanticweb.org/maic#ToleranceRuleShape</uri></binding><binding name='this'><uri>http://www.semanticweb.org/maic#Bathroom_Pod_Project</uri></binding><binding name='constraint'><bnode>bnode_f5f851d1_6f6c_4387_afea_a7df45edf510_172</bnode></binding><binding name='message'><literal>The tolerance of {$this} is lower than the production tolerance.</literal></binding><binding name='valueNode___'><uri>http://www.semanticweb.org/maic#Bathroom_Pod_Project</uri></binding></result></results></sparql>\\r\\n\",\n",
       " b'<?xml version=\"1.0\" encoding=\"UTF-8\"?>\\n<rdf:RDF\\n\\txmlns:rdf=\"http://www.w3.org/1999/02/22-rdf-syntax-ns#\">\\n\\n<rdf:Description rdf:about=\"http://www.semanticweb.org/maic#ComponentMaterialRuleShapeI\">\\n\\t<rdf:type rdf:resource=\"http://www.w3.org/ns/shacl#NodeShape\"/>\\n\\t<targetClass xmlns=\"http://www.w3.org/ns/shacl#\" rdf:resource=\"http://www.semanticweb.org/maic#Component\"/>\\n</rdf:Description>\\n\\n<rdf:Description rdf:nodeID=\"bnode_f5f851d1_6f6c_4387_afea_a7df45edf510_206\">\\n\\t<declare xmlns=\"http://www.w3.org/ns/shacl#\" rdf:nodeID=\"bnode_f5f851d1_6f6c_4387_afea_a7df45edf510_207\"/>\\n</rdf:Description>\\n\\n<rdf:Description rdf:about=\"http://www.semanticweb.org/maic#ComponentMaterialRuleShapeI\">\\n\\t<severity xmlns=\"http://www.w3.org/ns/shacl#\" rdf:resource=\"http://www.w3.org/ns/shacl#Warning\"/>\\n</rdf:Description>\\n\\n<rdf:Description rdf:nodeID=\"bnode_f5f851d1_6f6c_4387_afea_a7df45edf510_139\">\\n\\t<select xmlns=\"http://www.w3.org/ns/shacl#\" rdf:datatype=\"http://www.w3.org/2001/XMLSchema#string\">\\n SELECT *\\n WHERE {\\n {\\n  SELECT $this (SUM(?has_suited_direct_material) AS ?direct_material_count)\\n  WHERE {\\n   $this maic:hasMaterialType ?component_material .\\n   ?component_material maic:materialType ?component_material_type .\\n   ?component_material maic:fireMaterialClassification ?component_fire_material_classification .\\n   ?direct_material a maic:Direct_Material .\\n   ?direct_material maic:materialType ?direct_material_material_type .\\n   ?direct_material maic:fireMaterialClassification ?direct_material_fire_material_classification .\\n   BIND(IF(?component_material_type = ?direct_material_material_type &amp;&amp; ?component_fire_material_classification = ?direct_material_fire_material_classification, 1, 0) AS ?has_suited_direct_material) .\\n  }\\n  GROUP BY $this\\n  }\\n  FILTER (?direct_material_count = 0) .\\n }\\n HAVING BOUND($this)</select>\\n</rdf:Description>\\n\\n<rdf:Description rdf:nodeID=\"bnode_f5f851d1_6f6c_4387_afea_a7df45edf510_207\">\\n\\t<prefix xmlns=\"http://www.w3.org/ns/shacl#\" rdf:datatype=\"http://www.w3.org/2001/XMLSchema#string\">maic</prefix>\\n</rdf:Description>\\n\\n<rdf:Description rdf:nodeID=\"bnode_f5f851d1_6f6c_4387_afea_a7df45edf510_139\">\\n\\t<prefixes xmlns=\"http://www.w3.org/ns/shacl#\" rdf:nodeID=\"bnode_f5f851d1_6f6c_4387_afea_a7df45edf510_206\"/>\\n</rdf:Description>\\n\\n<rdf:Description rdf:about=\"http://www.semanticweb.org/maic#ComponentMaterialRuleShapeI\">\\n\\t<sparql xmlns=\"http://www.w3.org/ns/shacl#\" rdf:nodeID=\"bnode_f5f851d1_6f6c_4387_afea_a7df45edf510_139\"/>\\n</rdf:Description>\\n\\n<rdf:Description rdf:nodeID=\"bnode_f5f851d1_6f6c_4387_afea_a7df45edf510_139\">\\n\\t<message xmlns=\"http://www.w3.org/ns/shacl#\" rdf:datatype=\"http://www.w3.org/2001/XMLSchema#string\">There is no direct material with material type and fire-protection material classification of {$this}.</message>\\n</rdf:Description>\\n\\n<rdf:Description rdf:nodeID=\"bnode_f5f851d1_6f6c_4387_afea_a7df45edf510_207\">\\n\\t<namespace xmlns=\"http://www.w3.org/ns/shacl#\" rdf:datatype=\"http://www.w3.org/2001/XMLSchema#anyURI\">http://www.semanticweb.org/maic#</namespace>\\n</rdf:Description>\\n\\n</rdf:RDF>\\r\\n',\n",
       " b\"<?xml version='1.0' encoding='UTF-8'?><sparql xmlns='http://www.w3.org/2005/sparql-results#'><head><variable name='severity'/><variable name='component'/><variable name='shape'/><variable name='this'/><variable name='constraint'/><variable name='message'/><variable name='valueNode___'/></head><results><result><binding name='severity'><uri>http://www.w3.org/ns/shacl#Warning</uri></binding><binding name='component'><uri>http://www.w3.org/ns/shacl#SPARQLConstraintComponent</uri></binding><binding name='shape'><uri>http://www.semanticweb.org/maic#ComponentMaterialRuleShapeI</uri></binding><binding name='this'><uri>http://www.semanticweb.org/maic#Bathroom_Pod</uri></binding><binding name='constraint'><bnode>bnode_f5f851d1_6f6c_4387_afea_a7df45edf510_139</bnode></binding><binding name='message'><literal>There is no direct material with material type and fire-protection material classification of {$this}.</literal></binding><binding name='valueNode___'><uri>http://www.semanticweb.org/maic#Bathroom_Pod</uri></binding></result></results></sparql>\\r\\n\",\n",
       " b'<?xml version=\"1.0\" encoding=\"UTF-8\"?>\\n<rdf:RDF\\n\\txmlns:rdf=\"http://www.w3.org/1999/02/22-rdf-syntax-ns#\">\\n\\n<rdf:Description rdf:nodeID=\"bnode_f5f851d1_6f6c_4387_afea_a7df45edf510_209\">\\n\\t<prefix xmlns=\"http://www.w3.org/ns/shacl#\" rdf:datatype=\"http://www.w3.org/2001/XMLSchema#string\">maic</prefix>\\n</rdf:Description>\\n\\n<rdf:Description rdf:about=\"http://www.semanticweb.org/maic#CostsRuleShapeIII\">\\n\\t<rdf:type rdf:resource=\"http://www.w3.org/ns/shacl#NodeShape\"/>\\n</rdf:Description>\\n\\n<rdf:Description rdf:nodeID=\"bnode_f5f851d1_6f6c_4387_afea_a7df45edf510_208\">\\n\\t<declare xmlns=\"http://www.w3.org/ns/shacl#\" rdf:nodeID=\"bnode_f5f851d1_6f6c_4387_afea_a7df45edf510_209\"/>\\n</rdf:Description>\\n\\n<rdf:Description rdf:nodeID=\"bnode_f5f851d1_6f6c_4387_afea_a7df45edf510_187\">\\n\\t<select xmlns=\"http://www.w3.org/ns/shacl#\" rdf:datatype=\"http://www.w3.org/2001/XMLSchema#string\">\\n SELECT $this (SUM(?resource_cost) AS ?total_equipment_cost)\\n WHERE {\\n  $this maic:consistOf ?workstation .\\n  ?workstation maic:consistOf ?activity .\\n  ?activity maic:consumes ?resource .\\n  ?resource maic:hasResourceCost ?resource_cost .\\n  ?resource rdf:type ?resource_type .\\n  FILTER(?resource_type = maic:Direct_Equipment) .\\n }\\n GROUP BY $this\\n HAVING BOUND($this)</select>\\n\\t<prefixes xmlns=\"http://www.w3.org/ns/shacl#\" rdf:nodeID=\"bnode_f5f851d1_6f6c_4387_afea_a7df45edf510_208\"/>\\n</rdf:Description>\\n\\n<rdf:Description rdf:about=\"http://www.semanticweb.org/maic#CostsRuleShapeIII\">\\n\\t<sparql xmlns=\"http://www.w3.org/ns/shacl#\" rdf:nodeID=\"bnode_f5f851d1_6f6c_4387_afea_a7df45edf510_187\"/>\\n\\t<targetClass xmlns=\"http://www.w3.org/ns/shacl#\" rdf:resource=\"http://www.semanticweb.org/maic#Production_Process\"/>\\n\\t<severity xmlns=\"http://www.w3.org/ns/shacl#\" rdf:resource=\"http://www.w3.org/ns/shacl#Info\"/>\\n</rdf:Description>\\n\\n<rdf:Description rdf:nodeID=\"bnode_f5f851d1_6f6c_4387_afea_a7df45edf510_187\">\\n\\t<message xmlns=\"http://www.w3.org/ns/shacl#\" rdf:datatype=\"http://www.w3.org/2001/XMLSchema#string\">The cost of direct equipment consumed during {$this} is CHF {?total_equipment_cost}.</message>\\n</rdf:Description>\\n\\n<rdf:Description rdf:nodeID=\"bnode_f5f851d1_6f6c_4387_afea_a7df45edf510_209\">\\n\\t<namespace xmlns=\"http://www.w3.org/ns/shacl#\" rdf:datatype=\"http://www.w3.org/2001/XMLSchema#anyURI\">http://www.semanticweb.org/maic#</namespace>\\n</rdf:Description>\\n\\n</rdf:RDF>\\r\\n',\n",
       " b\"<?xml version='1.0' encoding='UTF-8'?><sparql xmlns='http://www.w3.org/2005/sparql-results#'><head><variable name='severity'/><variable name='component'/><variable name='shape'/><variable name='this'/><variable name='constraint'/><variable name='message'/><variable name='valueNode___'/></head><results><result><binding name='severity'><uri>http://www.w3.org/ns/shacl#Info</uri></binding><binding name='component'><uri>http://www.w3.org/ns/shacl#SPARQLConstraintComponent</uri></binding><binding name='shape'><uri>http://www.semanticweb.org/maic#CostsRuleShapeIII</uri></binding><binding name='this'><uri>http://www.semanticweb.org/maic#ERNEs_Weinmann_Production_Process</uri></binding><binding name='constraint'><bnode>bnode_f5f851d1_6f6c_4387_afea_a7df45edf510_187</bnode></binding><binding name='message'><literal>The cost of direct equipment consumed during {$this} is CHF {?total_equipment_cost}.</literal></binding><binding name='valueNode___'><uri>http://www.semanticweb.org/maic#ERNEs_Weinmann_Production_Process</uri></binding></result></results></sparql>\\r\\n\",\n",
       " b'<?xml version=\"1.0\" encoding=\"UTF-8\"?>\\n<rdf:RDF\\n\\txmlns:rdf=\"http://www.w3.org/1999/02/22-rdf-syntax-ns#\">\\n\\n<rdf:Description rdf:about=\"http://www.semanticweb.org/maic#CostsRuleShapeII\">\\n\\t<rdf:type rdf:resource=\"http://www.w3.org/ns/shacl#NodeShape\"/>\\n</rdf:Description>\\n\\n<rdf:Description rdf:nodeID=\"bnode_f5f851d1_6f6c_4387_afea_a7df45edf510_211\">\\n\\t<prefix xmlns=\"http://www.w3.org/ns/shacl#\" rdf:datatype=\"http://www.w3.org/2001/XMLSchema#string\">maic</prefix>\\n</rdf:Description>\\n\\n<rdf:Description rdf:nodeID=\"bnode_f5f851d1_6f6c_4387_afea_a7df45edf510_184\">\\n\\t<select xmlns=\"http://www.w3.org/ns/shacl#\" rdf:datatype=\"http://www.w3.org/2001/XMLSchema#string\">\\n   SELECT $this (SUM(?direct_material_cost_adjusted) AS ?total_direct_material_cost)\\n   WHERE {\\n   $this maic:consistOfIntersection ?intersection .\\n   ?intersection maic:isProducedUsing ?direct_material .\\n   ?direct_material maic:hasCapability ?capability .\\n   ?capability maic:connectionMaterialIndex ?connection_material_index .\\n   ?direct_material maic:hasResourceCost ?direct_material_cost .\\n   BIND(?direct_material_cost * ?connection_material_index AS ?direct_material_cost_adjusted) .\\n  }\\n  GROUP BY $this\\n  HAVING BOUND($this)</select>\\n\\t<message xmlns=\"http://www.w3.org/ns/shacl#\" rdf:datatype=\"http://www.w3.org/2001/XMLSchema#string\">The cost for the direct material consumed for intersections during {$this} is CHF {?total_direct_material_cost}.</message>\\n</rdf:Description>\\n\\n<rdf:Description rdf:about=\"http://www.semanticweb.org/maic#CostsRuleShapeII\">\\n\\t<targetClass xmlns=\"http://www.w3.org/ns/shacl#\" rdf:resource=\"http://www.semanticweb.org/maic#Product\"/>\\n</rdf:Description>\\n\\n<rdf:Description rdf:nodeID=\"bnode_f5f851d1_6f6c_4387_afea_a7df45edf510_184\">\\n\\t<prefixes xmlns=\"http://www.w3.org/ns/shacl#\" rdf:nodeID=\"bnode_f5f851d1_6f6c_4387_afea_a7df45edf510_210\"/>\\n</rdf:Description>\\n\\n<rdf:Description rdf:about=\"http://www.semanticweb.org/maic#CostsRuleShapeII\">\\n\\t<sparql xmlns=\"http://www.w3.org/ns/shacl#\" rdf:nodeID=\"bnode_f5f851d1_6f6c_4387_afea_a7df45edf510_184\"/>\\n</rdf:Description>\\n\\n<rdf:Description rdf:nodeID=\"bnode_f5f851d1_6f6c_4387_afea_a7df45edf510_211\">\\n\\t<namespace xmlns=\"http://www.w3.org/ns/shacl#\" rdf:datatype=\"http://www.w3.org/2001/XMLSchema#anyURI\">http://www.semanticweb.org/maic#</namespace>\\n</rdf:Description>\\n\\n<rdf:Description rdf:nodeID=\"bnode_f5f851d1_6f6c_4387_afea_a7df45edf510_210\">\\n\\t<declare xmlns=\"http://www.w3.org/ns/shacl#\" rdf:nodeID=\"bnode_f5f851d1_6f6c_4387_afea_a7df45edf510_211\"/>\\n</rdf:Description>\\n\\n<rdf:Description rdf:about=\"http://www.semanticweb.org/maic#CostsRuleShapeII\">\\n\\t<severity xmlns=\"http://www.w3.org/ns/shacl#\" rdf:resource=\"http://www.w3.org/ns/shacl#Info\"/>\\n</rdf:Description>\\n\\n</rdf:RDF>\\r\\n',\n",
       " b\"<?xml version='1.0' encoding='UTF-8'?><sparql xmlns='http://www.w3.org/2005/sparql-results#'><head><variable name='severity'/><variable name='component'/><variable name='shape'/><variable name='this'/><variable name='constraint'/><variable name='message'/><variable name='valueNode___'/></head><results><result><binding name='severity'><uri>http://www.w3.org/ns/shacl#Info</uri></binding><binding name='component'><uri>http://www.w3.org/ns/shacl#SPARQLConstraintComponent</uri></binding><binding name='shape'><uri>http://www.semanticweb.org/maic#CostsRuleShapeII</uri></binding><binding name='this'><uri>http://www.semanticweb.org/maic#Bathroom_Pod_Project</uri></binding><binding name='constraint'><bnode>bnode_f5f851d1_6f6c_4387_afea_a7df45edf510_184</bnode></binding><binding name='message'><literal>The cost for the direct material consumed for intersections during {$this} is CHF {?total_direct_material_cost}.</literal></binding><binding name='valueNode___'><uri>http://www.semanticweb.org/maic#Bathroom_Pod_Project</uri></binding></result></results></sparql>\\r\\n\",\n",
       " b'<?xml version=\"1.0\" encoding=\"UTF-8\"?>\\n<rdf:RDF\\n\\txmlns:rdf=\"http://www.w3.org/1999/02/22-rdf-syntax-ns#\">\\n\\n<rdf:Description rdf:nodeID=\"bnode_f5f851d1_6f6c_4387_afea_a7df45edf510_213\">\\n\\t<namespace xmlns=\"http://www.w3.org/ns/shacl#\" rdf:datatype=\"http://www.w3.org/2001/XMLSchema#anyURI\">http://www.semanticweb.org/maic#</namespace>\\n</rdf:Description>\\n\\n<rdf:Description rdf:about=\"http://www.semanticweb.org/maic#DurationRuleShapeII\">\\n\\t<sparql xmlns=\"http://www.w3.org/ns/shacl#\" rdf:nodeID=\"bnode_f5f851d1_6f6c_4387_afea_a7df45edf510_178\"/>\\n\\t<severity xmlns=\"http://www.w3.org/ns/shacl#\" rdf:resource=\"http://www.w3.org/ns/shacl#Info\"/>\\n\\t<rdf:type rdf:resource=\"http://www.w3.org/ns/shacl#NodeShape\"/>\\n</rdf:Description>\\n\\n<rdf:Description rdf:nodeID=\"bnode_f5f851d1_6f6c_4387_afea_a7df45edf510_178\">\\n\\t<message xmlns=\"http://www.w3.org/ns/shacl#\" rdf:datatype=\"http://www.w3.org/2001/XMLSchema#string\">The average cycle time of {$this} is {?total_cycle_time} seconds.</message>\\n</rdf:Description>\\n\\n<rdf:Description rdf:about=\"http://www.semanticweb.org/maic#DurationRuleShapeII\">\\n\\t<targetClass xmlns=\"http://www.w3.org/ns/shacl#\" rdf:resource=\"http://www.semanticweb.org/maic#Production_Process\"/>\\n</rdf:Description>\\n\\n<rdf:Description rdf:nodeID=\"bnode_f5f851d1_6f6c_4387_afea_a7df45edf510_178\">\\n\\t<select xmlns=\"http://www.w3.org/ns/shacl#\" rdf:datatype=\"http://www.w3.org/2001/XMLSchema#string\">\\n   SELECT  $this (SUM(?cycle_time) AS ?total_cycle_time)\\n   WHERE {\\n    $this maic:consistOf ?workstation .\\n    ?workstation maic:consistOf ?activity .\\n    ?activity maic:cycleTime_average ?cycle_time .\\n  }\\n  GROUP BY $this\\n  HAVING BOUND($this)</select>\\n</rdf:Description>\\n\\n<rdf:Description rdf:nodeID=\"bnode_f5f851d1_6f6c_4387_afea_a7df45edf510_212\">\\n\\t<declare xmlns=\"http://www.w3.org/ns/shacl#\" rdf:nodeID=\"bnode_f5f851d1_6f6c_4387_afea_a7df45edf510_213\"/>\\n</rdf:Description>\\n\\n<rdf:Description rdf:nodeID=\"bnode_f5f851d1_6f6c_4387_afea_a7df45edf510_178\">\\n\\t<prefixes xmlns=\"http://www.w3.org/ns/shacl#\" rdf:nodeID=\"bnode_f5f851d1_6f6c_4387_afea_a7df45edf510_212\"/>\\n</rdf:Description>\\n\\n<rdf:Description rdf:nodeID=\"bnode_f5f851d1_6f6c_4387_afea_a7df45edf510_213\">\\n\\t<prefix xmlns=\"http://www.w3.org/ns/shacl#\" rdf:datatype=\"http://www.w3.org/2001/XMLSchema#string\">maic</prefix>\\n</rdf:Description>\\n\\n</rdf:RDF>\\r\\n',\n",
       " b\"<?xml version='1.0' encoding='UTF-8'?><sparql xmlns='http://www.w3.org/2005/sparql-results#'><head><variable name='severity'/><variable name='component'/><variable name='shape'/><variable name='this'/><variable name='constraint'/><variable name='message'/><variable name='valueNode___'/></head><results><result><binding name='severity'><uri>http://www.w3.org/ns/shacl#Info</uri></binding><binding name='component'><uri>http://www.w3.org/ns/shacl#SPARQLConstraintComponent</uri></binding><binding name='shape'><uri>http://www.semanticweb.org/maic#DurationRuleShapeII</uri></binding><binding name='this'><uri>http://www.semanticweb.org/maic#ERNEs_Weinmann_Production_Process</uri></binding><binding name='constraint'><bnode>bnode_f5f851d1_6f6c_4387_afea_a7df45edf510_178</bnode></binding><binding name='message'><literal>The average cycle time of {$this} is {?total_cycle_time} seconds.</literal></binding><binding name='valueNode___'><uri>http://www.semanticweb.org/maic#ERNEs_Weinmann_Production_Process</uri></binding></result></results></sparql>\\r\\n\",\n",
       " b'<?xml version=\"1.0\" encoding=\"UTF-8\"?>\\n<rdf:RDF\\n\\txmlns:rdf=\"http://www.w3.org/1999/02/22-rdf-syntax-ns#\">\\n\\n<rdf:Description rdf:about=\"http://www.semanticweb.org/maic#ProductionProcessRuleShape\">\\n\\t<targetClass xmlns=\"http://www.w3.org/ns/shacl#\" rdf:resource=\"http://www.semanticweb.org/maic#Component\"/>\\n</rdf:Description>\\n\\n<rdf:Description rdf:nodeID=\"bnode_f5f851d1_6f6c_4387_afea_a7df45edf510_136\">\\n\\t<message xmlns=\"http://www.w3.org/ns/shacl#\" rdf:datatype=\"http://www.w3.org/2001/XMLSchema#string\">There is no work station in the production process to produce {$this}.</message>\\n</rdf:Description>\\n\\n<rdf:Description rdf:about=\"http://www.semanticweb.org/maic#ProductionProcessRuleShape\">\\n\\t<sparql xmlns=\"http://www.w3.org/ns/shacl#\" rdf:nodeID=\"bnode_f5f851d1_6f6c_4387_afea_a7df45edf510_136\"/>\\n</rdf:Description>\\n\\n<rdf:Description rdf:nodeID=\"bnode_f5f851d1_6f6c_4387_afea_a7df45edf510_136\">\\n\\t<select xmlns=\"http://www.w3.org/ns/shacl#\" rdf:datatype=\"http://www.w3.org/2001/XMLSchema#string\">\\n SELECT *\\n WHERE {\\n    {\\n    SELECT $this (SUM(?typology_count) as ?total_typology)\\n    WHERE {\\n        $this maic:hasType ?component_typology .\\n        ?component_typology rdf:type ?component_typology_type .\\n        ?workstation maic:hasCapabilityToProduceType ?workstation_typology .\\n        BIND(IF(?workstation_typology = ?component_typology || ?component_typology_type = maic:Element, 1, 0) AS ?typology_count) .\\n    }\\n    GROUP BY $this\\n    }\\n    FILTER(?total_typology = 0) .\\n }\\n HAVING BOUND($this)</select>\\n</rdf:Description>\\n\\n<rdf:Description rdf:nodeID=\"bnode_f5f851d1_6f6c_4387_afea_a7df45edf510_214\">\\n\\t<declare xmlns=\"http://www.w3.org/ns/shacl#\" rdf:nodeID=\"bnode_f5f851d1_6f6c_4387_afea_a7df45edf510_215\"/>\\n</rdf:Description>\\n\\n<rdf:Description rdf:about=\"http://www.semanticweb.org/maic#ProductionProcessRuleShape\">\\n\\t<severity xmlns=\"http://www.w3.org/ns/shacl#\" rdf:resource=\"http://www.w3.org/ns/shacl#Warning\"/>\\n</rdf:Description>\\n\\n<rdf:Description rdf:nodeID=\"bnode_f5f851d1_6f6c_4387_afea_a7df45edf510_136\">\\n\\t<prefixes xmlns=\"http://www.w3.org/ns/shacl#\" rdf:nodeID=\"bnode_f5f851d1_6f6c_4387_afea_a7df45edf510_214\"/>\\n</rdf:Description>\\n\\n<rdf:Description rdf:nodeID=\"bnode_f5f851d1_6f6c_4387_afea_a7df45edf510_215\">\\n\\t<prefix xmlns=\"http://www.w3.org/ns/shacl#\" rdf:datatype=\"http://www.w3.org/2001/XMLSchema#string\">maic</prefix>\\n\\t<namespace xmlns=\"http://www.w3.org/ns/shacl#\" rdf:datatype=\"http://www.w3.org/2001/XMLSchema#anyURI\">http://www.semanticweb.org/maic#</namespace>\\n</rdf:Description>\\n\\n<rdf:Description rdf:about=\"http://www.semanticweb.org/maic#ProductionProcessRuleShape\">\\n\\t<rdf:type rdf:resource=\"http://www.w3.org/ns/shacl#NodeShape\"/>\\n</rdf:Description>\\n\\n</rdf:RDF>\\r\\n',\n",
       " b\"<?xml version='1.0' encoding='UTF-8'?><sparql xmlns='http://www.w3.org/2005/sparql-results#'><head><variable name='severity'/><variable name='component'/><variable name='shape'/><variable name='this'/><variable name='constraint'/><variable name='message'/><variable name='valueNode___'/></head><results><result><binding name='severity'><uri>http://www.w3.org/ns/shacl#Warning</uri></binding><binding name='component'><uri>http://www.w3.org/ns/shacl#SPARQLConstraintComponent</uri></binding><binding name='shape'><uri>http://www.semanticweb.org/maic#ProductionProcessRuleShape</uri></binding><binding name='this'><uri>http://www.semanticweb.org/maic#Bathroom_Pod</uri></binding><binding name='constraint'><bnode>bnode_f5f851d1_6f6c_4387_afea_a7df45edf510_136</bnode></binding><binding name='message'><literal>There is no work station in the production process to produce {$this}.</literal></binding><binding name='valueNode___'><uri>http://www.semanticweb.org/maic#Bathroom_Pod</uri></binding></result></results></sparql>\\r\\n\",\n",
       " b'<?xml version=\"1.0\" encoding=\"UTF-8\"?>\\n<rdf:RDF\\n\\txmlns:rdf=\"http://www.w3.org/1999/02/22-rdf-syntax-ns#\">\\n\\n<rdf:Description rdf:about=\"http://www.semanticweb.org/maic#CostsRuleShapeI\">\\n\\t<sparql xmlns=\"http://www.w3.org/ns/shacl#\" rdf:nodeID=\"bnode_f5f851d1_6f6c_4387_afea_a7df45edf510_181\"/>\\n\\t<rdf:type rdf:resource=\"http://www.w3.org/ns/shacl#NodeShape\"/>\\n</rdf:Description>\\n\\n<rdf:Description rdf:nodeID=\"bnode_f5f851d1_6f6c_4387_afea_a7df45edf510_181\">\\n\\t<select xmlns=\"http://www.w3.org/ns/shacl#\" rdf:datatype=\"http://www.w3.org/2001/XMLSchema#string\">\\n   SELECT $this (SUM(?direct_material_cost) AS ?total_direct_material_cost)\\n   WHERE {\\n   $this maic:consistOfComponent ?component .\\n   ?component maic:isProducedUsing ?direct_material .\\n   ?direct_material maic:hasResourceCost ?direct_material_cost .\\n  }\\n  GROUP BY $this\\n  HAVING BOUND($this)</select>\\n</rdf:Description>\\n\\n<rdf:Description rdf:about=\"http://www.semanticweb.org/maic#CostsRuleShapeI\">\\n\\t<severity xmlns=\"http://www.w3.org/ns/shacl#\" rdf:resource=\"http://www.w3.org/ns/shacl#Info\"/>\\n</rdf:Description>\\n\\n<rdf:Description rdf:nodeID=\"bnode_f5f851d1_6f6c_4387_afea_a7df45edf510_216\">\\n\\t<declare xmlns=\"http://www.w3.org/ns/shacl#\" rdf:nodeID=\"bnode_f5f851d1_6f6c_4387_afea_a7df45edf510_217\"/>\\n</rdf:Description>\\n\\n<rdf:Description rdf:nodeID=\"bnode_f5f851d1_6f6c_4387_afea_a7df45edf510_217\">\\n\\t<prefix xmlns=\"http://www.w3.org/ns/shacl#\" rdf:datatype=\"http://www.w3.org/2001/XMLSchema#string\">maic</prefix>\\n</rdf:Description>\\n\\n<rdf:Description rdf:nodeID=\"bnode_f5f851d1_6f6c_4387_afea_a7df45edf510_181\">\\n\\t<message xmlns=\"http://www.w3.org/ns/shacl#\" rdf:datatype=\"http://www.w3.org/2001/XMLSchema#string\">The cost for the direct material consumed for components during {$this} is CHF {?total_direct_material_cost}.</message>\\n\\t<prefixes xmlns=\"http://www.w3.org/ns/shacl#\" rdf:nodeID=\"bnode_f5f851d1_6f6c_4387_afea_a7df45edf510_216\"/>\\n</rdf:Description>\\n\\n<rdf:Description rdf:about=\"http://www.semanticweb.org/maic#CostsRuleShapeI\">\\n\\t<targetClass xmlns=\"http://www.w3.org/ns/shacl#\" rdf:resource=\"http://www.semanticweb.org/maic#Product\"/>\\n</rdf:Description>\\n\\n<rdf:Description rdf:nodeID=\"bnode_f5f851d1_6f6c_4387_afea_a7df45edf510_217\">\\n\\t<namespace xmlns=\"http://www.w3.org/ns/shacl#\" rdf:datatype=\"http://www.w3.org/2001/XMLSchema#anyURI\">http://www.semanticweb.org/maic#</namespace>\\n</rdf:Description>\\n\\n</rdf:RDF>\\r\\n',\n",
       " b\"<?xml version='1.0' encoding='UTF-8'?><sparql xmlns='http://www.w3.org/2005/sparql-results#'><head><variable name='severity'/><variable name='component'/><variable name='shape'/><variable name='this'/><variable name='constraint'/><variable name='message'/><variable name='valueNode___'/></head><results><result><binding name='severity'><uri>http://www.w3.org/ns/shacl#Info</uri></binding><binding name='component'><uri>http://www.w3.org/ns/shacl#SPARQLConstraintComponent</uri></binding><binding name='shape'><uri>http://www.semanticweb.org/maic#CostsRuleShapeI</uri></binding><binding name='this'><uri>http://www.semanticweb.org/maic#Bathroom_Pod_Project</uri></binding><binding name='constraint'><bnode>bnode_f5f851d1_6f6c_4387_afea_a7df45edf510_181</bnode></binding><binding name='message'><literal>The cost for the direct material consumed for components during {$this} is CHF {?total_direct_material_cost}.</literal></binding><binding name='valueNode___'><uri>http://www.semanticweb.org/maic#Bathroom_Pod_Project</uri></binding></result></results></sparql>\\r\\n\",\n",
       " b'<?xml version=\"1.0\" encoding=\"UTF-8\"?>\\n<rdf:RDF\\n\\txmlns:rdf=\"http://www.w3.org/1999/02/22-rdf-syntax-ns#\">\\n\\n<rdf:Description rdf:nodeID=\"bnode_f5f851d1_6f6c_4387_afea_a7df45edf510_218\">\\n\\t<declare xmlns=\"http://www.w3.org/ns/shacl#\" rdf:nodeID=\"bnode_f5f851d1_6f6c_4387_afea_a7df45edf510_219\"/>\\n</rdf:Description>\\n\\n<rdf:Description rdf:about=\"http://www.semanticweb.org/maic#CostsRuleShapeIV\">\\n\\t<rdf:type rdf:resource=\"http://www.w3.org/ns/shacl#NodeShape\"/>\\n\\t<sparql xmlns=\"http://www.w3.org/ns/shacl#\" rdf:nodeID=\"bnode_f5f851d1_6f6c_4387_afea_a7df45edf510_190\"/>\\n\\t<severity xmlns=\"http://www.w3.org/ns/shacl#\" rdf:resource=\"http://www.w3.org/ns/shacl#Info\"/>\\n</rdf:Description>\\n\\n<rdf:Description rdf:nodeID=\"bnode_f5f851d1_6f6c_4387_afea_a7df45edf510_190\">\\n\\t<select xmlns=\"http://www.w3.org/ns/shacl#\" rdf:datatype=\"http://www.w3.org/2001/XMLSchema#string\">\\n SELECT $this (SUM(?resource_cost) AS ?total_labour_cost)\\n WHERE {\\n  $this maic:consistOf ?workstation .\\n  ?workstation maic:consistOf ?activity .\\n  ?activity maic:consumes ?resource .\\n  ?resource maic:hasResourceCost ?resource_cost .\\n  ?resource rdf:type ?resource_type .\\n  FILTER(?resource_type = maic:Direct_Labour) .\\n }\\n GROUP BY $this\\n HAVING BOUND($this)</select>\\n</rdf:Description>\\n\\n<rdf:Description rdf:about=\"http://www.semanticweb.org/maic#CostsRuleShapeIV\">\\n\\t<targetClass xmlns=\"http://www.w3.org/ns/shacl#\" rdf:resource=\"http://www.semanticweb.org/maic#Production_Process\"/>\\n</rdf:Description>\\n\\n<rdf:Description rdf:nodeID=\"bnode_f5f851d1_6f6c_4387_afea_a7df45edf510_219\">\\n\\t<namespace xmlns=\"http://www.w3.org/ns/shacl#\" rdf:datatype=\"http://www.w3.org/2001/XMLSchema#anyURI\">http://www.semanticweb.org/maic#</namespace>\\n</rdf:Description>\\n\\n<rdf:Description rdf:nodeID=\"bnode_f5f851d1_6f6c_4387_afea_a7df45edf510_190\">\\n\\t<prefixes xmlns=\"http://www.w3.org/ns/shacl#\" rdf:nodeID=\"bnode_f5f851d1_6f6c_4387_afea_a7df45edf510_218\"/>\\n</rdf:Description>\\n\\n<rdf:Description rdf:nodeID=\"bnode_f5f851d1_6f6c_4387_afea_a7df45edf510_219\">\\n\\t<prefix xmlns=\"http://www.w3.org/ns/shacl#\" rdf:datatype=\"http://www.w3.org/2001/XMLSchema#string\">maic</prefix>\\n</rdf:Description>\\n\\n<rdf:Description rdf:nodeID=\"bnode_f5f851d1_6f6c_4387_afea_a7df45edf510_190\">\\n\\t<message xmlns=\"http://www.w3.org/ns/shacl#\" rdf:datatype=\"http://www.w3.org/2001/XMLSchema#string\">The cost of direct labour consumed during {$this} is CHF {?total_labour_cost}.</message>\\n</rdf:Description>\\n\\n</rdf:RDF>\\r\\n',\n",
       " b\"<?xml version='1.0' encoding='UTF-8'?><sparql xmlns='http://www.w3.org/2005/sparql-results#'><head><variable name='severity'/><variable name='component'/><variable name='shape'/><variable name='this'/><variable name='constraint'/><variable name='message'/><variable name='valueNode___'/></head><results><result><binding name='severity'><uri>http://www.w3.org/ns/shacl#Info</uri></binding><binding name='component'><uri>http://www.w3.org/ns/shacl#SPARQLConstraintComponent</uri></binding><binding name='shape'><uri>http://www.semanticweb.org/maic#CostsRuleShapeIV</uri></binding><binding name='this'><uri>http://www.semanticweb.org/maic#ERNEs_Weinmann_Production_Process</uri></binding><binding name='constraint'><bnode>bnode_f5f851d1_6f6c_4387_afea_a7df45edf510_190</bnode></binding><binding name='message'><literal>The cost of direct labour consumed during {$this} is CHF {?total_labour_cost}.</literal></binding><binding name='valueNode___'><uri>http://www.semanticweb.org/maic#ERNEs_Weinmann_Production_Process</uri></binding></result></results></sparql>\"]"
      ]
     },
     "execution_count": 126,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "webbased_validation_result"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 127,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "['{?negative_shape_and_size} of {$this} cannot be created by any equipment.',\n",
       " 'There is no capability in the production process to create {$this} from any direct material.',\n",
       " 'There is no direct material with the same material type and fire classification, which has the same or larger dimensions than {$this}.',\n",
       " 'The cost of all activities of {$this} is CHF {?total_activity_cost}.',\n",
       " 'The tolerance of {$this} is lower than the production tolerance.',\n",
       " 'There is no direct material with material type and fire-protection material classification of {$this}.',\n",
       " 'The cost of direct equipment consumed during {$this} is CHF {?total_equipment_cost}.',\n",
       " 'The cost for the direct material consumed for intersections during {$this} is CHF {?total_direct_material_cost}.',\n",
       " 'The average cycle time of {$this} is {?total_cycle_time} seconds.',\n",
       " 'There is no work station in the production process to produce {$this}.',\n",
       " 'The cost for the direct material consumed for components during {$this} is CHF {?total_direct_material_cost}.',\n",
       " 'The cost of direct labour consumed during {$this} is CHF {?total_labour_cost}.']"
      ]
     },
     "execution_count": 127,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "webbased_validation_result = str(webbased_validation_result)\n",
    "prefix = \"<binding name='message'><literal>\"\n",
    "suffix = '</literal></binding>'\n",
    "webbased_occurences_start = [m.end() for m in re.finditer(prefix, webbased_validation_result)] # list contains all indices prefix occurences\n",
    "webbased_occurences_end = [webbased_validation_result[pos:].find(suffix) + pos for pos in webbased_occurences_start] # list contains all indices suffix occurences\n",
    "webbased_occurences = [webbased_validation_result[s:e].strip() for s, e in zip(webbased_occurences_start, webbased_occurences_end)] # list constains all messages\n",
    "webbased_occurences = [o.replace('http://www.semanticweb.org/maic#', '') for o in webbased_occurences] # remove namespace from list of messages\n",
    "webbased_occurences"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## 1.7 Comments to validation report\n",
    "\n",
    "StarDogs validator conforms false for empty set SPARQL select query results like the ones specified in the SPARQL 1.1 Validation Test (https://www.w3.org/2009/sparql/docs/tests/summary.html#aggregates-agg-empty-group). Therefore, validation results contain false warnings from ComponentMaterialRuleShapeI, ComponentMaterialRuleShapeII, ComponentMaterialRuleShapeIII, NegativeShapeAndSizeRuleShape, ToleranceRuleShape. Please ignore the corresponding results.\n",
    "This issue was reported to the StarDog engineers (https://community.stardog.com/t/shacl-sparql-for-empty-sparql-select-query-results/3530). An StarDog internal ticket to resolve the problem was already created\n",
    "\n",
    "The StarDog SHACL validation report does not conform with the W3C documentation. SPARQL variables cannot be bound to the SHACL message as defined in the documentation (https://www.w3.org/TR/shacl/#sparql-constraints-variables). This issue was reported to the StarDog engineers (https://community.stardog.com/t/shacl-sparql-mapping-of-variables-to-sh-message/3477). A corresponding feature request was created."
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "***"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# 2. Local approach of use case (implementation on local environment)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## 2.1 Parse ontology"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 128,
   "metadata": {},
   "outputs": [],
   "source": [
    "onto_graph = Graph().parse(owl_file_path, format='xml')"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## 2.2 Parse use case data"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 129,
   "metadata": {},
   "outputs": [],
   "source": [
    "use_case_data_graph = Graph().parse(data = use_case_data , format = 'turtle')"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## 2.3 Import SPARQL rules"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 130,
   "metadata": {},
   "outputs": [],
   "source": [
    "use_case_data_graph.update(manufacturing_rules_SPARQL)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## 2.4 Parse SHACL rules"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 131,
   "metadata": {},
   "outputs": [],
   "source": [
    "shape_graph = Graph().parse(data = manufacturing_rules_SHACL, format='turtle')"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## 2.5 Validate against the SHACL rules"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 132,
   "metadata": {},
   "outputs": [],
   "source": [
    "local_validation_result = validate(data_graph = use_case_data_graph, shacl_graph = shape_graph, ont_graph = onto_graph, inference='rdfs', )\n",
    "conforms, results_graph, results_text = local_validation_result"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 133,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "(False,\n",
       " <Graph identifier=Nbf054cdf1d1849669f95a6c5c9beec03 (<class 'rdflib.graph.Graph'>)>,\n",
       " 'Validation Report\\nConforms: False\\nResults (5):\\nValidation Result in SPARQLConstraintComponent (http://www.w3.org/ns/shacl#SPARQLConstraintComponent):\\n\\tSeverity: sh:Info\\n\\tSource Shape: maic:DurationRuleShapeII\\n\\tFocus Node: maic:ERNEs_Weinmann_Production_Process\\n\\tValue Node: maic:ERNEs_Weinmann_Production_Process\\n\\tSource Constraint: [ rdf:type sh:SPARQLConstraint ; sh:message Literal(\"The average cycle time of {$this} is {?total_cycle_time} seconds.\") ; sh:prefixes [ sh:declare [ sh:namespace Literal(\"http://www.semanticweb.org/maic#\", datatype=xsd:anyURI) ; sh:prefix Literal(\"maic\") ] ] ; sh:select Literal(\"\\n   SELECT  $this (SUM(?cycle_time) AS ?total_cycle_time)\\n   WHERE {\\n    $this maic:consistOf ?workstation .\\n    ?workstation maic:consistOf ?activity .\\n    ?activity maic:cycleTime_average ?cycle_time .\\n  }\\n  GROUP BY $this\\n  HAVING BOUND($this)\") ]\\n\\tMessage: The average cycle time of http://www.semanticweb.org/maic#ERNEs_Weinmann_Production_Process is {?total_cycle_time} seconds.\\nValidation Result in SPARQLConstraintComponent (http://www.w3.org/ns/shacl#SPARQLConstraintComponent):\\n\\tSeverity: sh:Warning\\n\\tSource Shape: maic:ProductionProcessRuleShape\\n\\tFocus Node: maic:Bathroom_Pod\\n\\tValue Node: maic:Bathroom_Pod\\n\\tSource Constraint: [ rdf:type sh:SPARQLConstraint ; sh:message Literal(\"There is no work station in the production process to produce {$this}.\") ; sh:prefixes [ sh:declare [ sh:namespace Literal(\"http://www.semanticweb.org/maic#\", datatype=xsd:anyURI) ; sh:prefix Literal(\"maic\") ] ] ; sh:select Literal(\"\\n SELECT *\\n WHERE {\\n    {\\n    SELECT $this (SUM(?typology_count) as ?total_typology)\\n    WHERE {\\n        $this maic:hasType ?component_typology .\\n        ?component_typology rdf:type ?component_typology_type .\\n        ?workstation maic:hasCapabilityToProduceType ?workstation_typology .\\n        BIND(IF(?workstation_typology = ?component_typology || ?component_typology_type = maic:Element, 1, 0) AS ?typology_count) .\\n    }\\n    GROUP BY $this\\n    }\\n    FILTER(?total_typology = 0) .\\n }\\n HAVING BOUND($this)\") ]\\n\\tMessage: There is no work station in the production process to produce http://www.semanticweb.org/maic#Bathroom_Pod.\\nValidation Result in SPARQLConstraintComponent (http://www.w3.org/ns/shacl#SPARQLConstraintComponent):\\n\\tSeverity: sh:Info\\n\\tSource Shape: maic:CostsRuleShapeIV\\n\\tFocus Node: maic:ERNEs_Weinmann_Production_Process\\n\\tValue Node: maic:ERNEs_Weinmann_Production_Process\\n\\tSource Constraint: [ rdf:type sh:SPARQLConstraint ; sh:message Literal(\"The cost of direct labour consumed during {$this} is CHF {?total_labour_cost}.\") ; sh:prefixes [ sh:declare [ sh:namespace Literal(\"http://www.semanticweb.org/maic#\", datatype=xsd:anyURI) ; sh:prefix Literal(\"maic\") ] ] ; sh:select Literal(\"\\n SELECT $this (SUM(?resource_cost) AS ?total_labour_cost)\\n WHERE {\\n  $this maic:consistOf ?workstation .\\n  ?workstation maic:consistOf ?activity .\\n  ?activity maic:consumes ?resource .\\n  ?resource maic:hasResourceCost ?resource_cost .\\n  ?resource rdf:type ?resource_type .\\n  FILTER(?resource_type = maic:Direct_Labour) .\\n }\\n GROUP BY $this\\n HAVING BOUND($this)\") ]\\n\\tMessage: The cost of direct labour consumed during http://www.semanticweb.org/maic#ERNEs_Weinmann_Production_Process is CHF {?total_labour_cost}.\\nValidation Result in SPARQLConstraintComponent (http://www.w3.org/ns/shacl#SPARQLConstraintComponent):\\n\\tSeverity: sh:Info\\n\\tSource Shape: maic:CostsRuleShapeIII\\n\\tFocus Node: maic:ERNEs_Weinmann_Production_Process\\n\\tValue Node: maic:ERNEs_Weinmann_Production_Process\\n\\tSource Constraint: [ rdf:type sh:SPARQLConstraint ; sh:message Literal(\"The cost of direct equipment consumed during {$this} is CHF {?total_equipment_cost}.\") ; sh:prefixes [ sh:declare [ sh:namespace Literal(\"http://www.semanticweb.org/maic#\", datatype=xsd:anyURI) ; sh:prefix Literal(\"maic\") ] ] ; sh:select Literal(\"\\n SELECT $this (SUM(?resource_cost) AS ?total_equipment_cost)\\n WHERE {\\n  $this maic:consistOf ?workstation .\\n  ?workstation maic:consistOf ?activity .\\n  ?activity maic:consumes ?resource .\\n  ?resource maic:hasResourceCost ?resource_cost .\\n  ?resource rdf:type ?resource_type .\\n  FILTER(?resource_type = maic:Direct_Equipment) .\\n }\\n GROUP BY $this\\n HAVING BOUND($this)\") ]\\n\\tMessage: The cost of direct equipment consumed during http://www.semanticweb.org/maic#ERNEs_Weinmann_Production_Process is CHF {?total_equipment_cost}.\\nValidation Result in SPARQLConstraintComponent (http://www.w3.org/ns/shacl#SPARQLConstraintComponent):\\n\\tSeverity: sh:Info\\n\\tSource Shape: maic:CostsRuleShapeV\\n\\tFocus Node: maic:ERNEs_Weinmann_Production_Process\\n\\tValue Node: maic:ERNEs_Weinmann_Production_Process\\n\\tSource Constraint: [ rdf:type sh:SPARQLConstraint ; sh:message Literal(\"The cost of all activities of {$this} is CHF {?total_activity_cost}.\") ; sh:prefixes [ sh:declare [ sh:namespace Literal(\"http://www.semanticweb.org/maic#\", datatype=xsd:anyURI) ; sh:prefix Literal(\"maic\") ] ] ; sh:select Literal(\"\\n   SELECT $this (SUM(?activity_cost) AS ?total_activity_cost)\\n   WHERE {\\n   $this maic:consistOf ?workstation .\\n   ?workstation maic:consistOf ?activity .\\n   ?activity maic:hasActivityCost ?activity_cost .\\n  }\\n  GROUP BY $this\\n  HAVING BOUND($this)\") ]\\n\\tMessage: The cost of all activities of http://www.semanticweb.org/maic#ERNEs_Weinmann_Production_Process is CHF {?total_activity_cost}.\\n')"
      ]
     },
     "execution_count": 133,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "local_validation_result"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 134,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "['The average cycle time of ERNEs_Weinmann_Production_Process is {?total_cycle_time} seconds.',\n",
       " 'There is no work station in the production process to produce Bathroom_Pod.',\n",
       " 'The cost of direct labour consumed during ERNEs_Weinmann_Production_Process is CHF {?total_labour_cost}.',\n",
       " 'The cost of direct equipment consumed during ERNEs_Weinmann_Production_Process is CHF {?total_equipment_cost}.',\n",
       " 'The cost of all activities of ERNEs_Weinmann_Production_Process is CHF {?total_activity_cost}.']"
      ]
     },
     "execution_count": 134,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "local_validation_result = str(local_validation_result)\n",
    "prefix = 'Message:'\n",
    "suffix = '\\\\n'\n",
    "local_occurences_start = [m.end() for m in re.finditer(prefix, local_validation_result)] # list contains all indices prefix occurences\n",
    "local_occurences_end = [local_validation_result[pos:].find(suffix) + pos for pos in local_occurences_start] # list contains all indices suffix occurences\n",
    "local_occurences = [local_validation_result[s:e].strip() for s, e in zip(local_occurences_start, local_occurences_end)] # list constains all messages\n",
    "local_occurences = [o.replace('http://www.semanticweb.org/maic#', '') for o in local_occurences] # remove namespace from list of messages\n",
    "local_occurences"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 135,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "['maic:DurationRuleShapeII: The average cycle time of ERNEs_Weinmann_Production_Process is {?total_cycle_time} seconds.',\n",
       " 'maic:ProductionProcessRuleShape: There is no work station in the production process to produce Bathroom_Pod.',\n",
       " 'maic:CostsRuleShapeIV: The cost of direct labour consumed during ERNEs_Weinmann_Production_Process is CHF {?total_labour_cost}.',\n",
       " 'maic:CostsRuleShapeIII: The cost of direct equipment consumed during ERNEs_Weinmann_Production_Process is CHF {?total_equipment_cost}.',\n",
       " 'maic:CostsRuleShapeV: The cost of all activities of ERNEs_Weinmann_Production_Process is CHF {?total_activity_cost}.']"
      ]
     },
     "execution_count": 135,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# Transform validation result to a string\n",
    "local_validation_result = str(local_validation_result)\n",
    "\n",
    "# Define prefix and suffix to find in validation report\n",
    "prefix_I = 'Source Shape:'\n",
    "suffix_I = '\\\\n'\n",
    "prefix_II = 'Message:'\n",
    "suffix_II = '\\\\n'\n",
    "\n",
    "# Find all prefix and suffix occurences\n",
    "local_occurences_start_I = [m.end() for m in re.finditer(prefix_I, local_validation_result)] # list contains all indices of prefix_I occurences\n",
    "local_occurences_end_I = [local_validation_result[pos_I:].find(suffix_I) + pos_I for pos_I in local_occurences_start_I] # list contains all indices of suffix_I occurences\n",
    "local_occurences_start_II = [n.end() for n in re.finditer(prefix_II, local_validation_result)] # list contains all indices of prefix_II occurences\n",
    "local_occurences_end_II = [local_validation_result[pos_II:].find(suffix_II) + pos_II for pos_II in local_occurences_start_II] # list contains all indices of suffix_II occurences\n",
    "\n",
    "# Extract and merge strings to build a list of feedback sentences\n",
    "local_occurences = [local_validation_result[s_I:e_I].strip() + ': ' + local_validation_result[s_II:e_II].strip() for s_I, e_I, s_II, e_II in zip(local_occurences_start_I, local_occurences_end_I, local_occurences_start_II, local_occurences_end_II)] # list constains all RuleShape names and messages\n",
    "local_occurences = [o.replace('http://www.semanticweb.org/maic#', '') for o in local_occurences] # remove namespace from list of messages\n",
    "local_occurences"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## 2.5 Comments to validation report\n",
    "\n",
    "The Stardog SHACL validation report does not conform with the W3C documentation. SPARQL variables other than \"$this\" cannot be bound to the SHACL message as defined in the documentation (https://www.w3.org/TR/shacl/#sparql-constraints-variables).\n",
    "This issue was reported to the PYSHACL developers (https://github.com/RDFLib/pySHACL/issues/120). A corresponding feature request was created."
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.8.1"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
